[NoCoverage] BlockStatement
otus-reactjs/src/api/api.ts:5:49
 
 export type FetchUser = () => Promise<User>;
 
-export const fetchUser: FetchUser = async () => {
-  const response = await fetch('https://jsonplaceholder.typicode.com/users/1');
-  let userData = null;
-
-  if (response.ok) {
-    userData = await response.json();
-  } else {
-    console.error('Ошибка HTTP: ' + response.status);
-  }
-
-  return userData;
-};
+export const fetchUser: FetchUser = async () => {};
 

[NoCoverage] BlockStatement
otus-reactjs/src/api/api.ts:9:20
   const response = await fetch('https://jsonplaceholder.typicode.com/users/1');
   let userData = null;
 
-  if (response.ok) {
-    userData = await response.json();
-  } else {
+  if (response.ok) {} else {
     console.error('Ошибка HTTP: ' + response.status);
   }

[NoCoverage] BlockStatement
otus-reactjs/src/api/api.ts:11:10
 
   if (response.ok) {
     userData = await response.json();
-  } else {
-    console.error('Ошибка HTTP: ' + response.status);
-  }
+  } else {}
 
   return userData;
