[Timeout] BlockStatement
src/modules/user/useAuthRedux.ts:12:38
   resetName: () => void;
 }
 
-const useAuth = (): UserStateType => {
-  const [name, setName] = useState<string>('');
-
-  const dispatch = useDispatch();
-
-  const resetName = () => setName('');
-  const signin = () => {
-    const user = name.trim();
-
-    dispatch(UserActionCreator.signin(user.length ? user : null));
-  };
-
-  return {
-    currentName: name,
-    signin,
-    setName,
-    resetName,
-  };
-};
+const useAuth = (): UserStateType => {};
 
 export default useAuth;

[Timeout] ArrowFunction
src/modules/user/useAuthRedux.ts:17:21
 
   const dispatch = useDispatch();
 
-  const resetName = () => setName('');
+  const resetName = () => undefined;
   const signin = () => {
     const user = name.trim();

[Timeout] BlockStatement
src/modules/user/useAuthRedux.ts:18:24
   const dispatch = useDispatch();
 
   const resetName = () => setName('');
-  const signin = () => {
-    const user = name.trim();
-
-    dispatch(UserActionCreator.signin(user.length ? user : null));
-  };
+  const signin = () => {};
 
   return {
