[NoCoverage] BlockStatement
src/homework3/level_1/1.ts:18:73
 type OrderState = typeof orderStates[number];
 type FIXME = Exclude<OrderState, 'buyingSupplies' | 'producing'>[];
 
-export const getUserOrderStates = (orderStates: OrderState[]): FIXME => {
-  const filteredStates = [] as FIXME;
-  orderStates.forEach((element) => {
-    if (element !== 'buyingSupplies' && element !== 'producing') {
-      filteredStates.push(element);
-    }
-  });
-  return filteredStates;
-};
+export const getUserOrderStates = (orderStates: OrderState[]): FIXME => {};
 
 getUserOrderStates(['initial', 'inWork', 'producing']);

[NoCoverage] BlockStatement
src/homework3/level_1/1.ts:20:36
 
 export const getUserOrderStates = (orderStates: OrderState[]): FIXME => {
   const filteredStates = [] as FIXME;
-  orderStates.forEach((element) => {
-    if (element !== 'buyingSupplies' && element !== 'producing') {
-      filteredStates.push(element);
-    }
-  });
+  orderStates.forEach((element) => {});
   return filteredStates;
 };

[NoCoverage] ConditionalExpression
src/homework3/level_1/1.ts:21:9
 export const getUserOrderStates = (orderStates: OrderState[]): FIXME => {
   const filteredStates = [] as FIXME;
   orderStates.forEach((element) => {
-    if (element !== 'buyingSupplies' && element !== 'producing') {
+    if (false) {
       filteredStates.push(element);
     }

[NoCoverage] ConditionalExpression
src/homework3/level_1/1.ts:21:9
 export const getUserOrderStates = (orderStates: OrderState[]): FIXME => {
   const filteredStates = [] as FIXME;
   orderStates.forEach((element) => {
-    if (element !== 'buyingSupplies' && element !== 'producing') {
+    if (false && element !== 'producing') {
       filteredStates.push(element);
     }
