[NoCoverage] ArrowFunction
src/homework3/level_1/2.ts:40:30
 
 type FIXME = Order['state'];
 
-export const getOrderState = (order: Order): FIXME => order.state;
+export const getOrderState = () => undefined;
 
