[NoCoverage] BlockStatement
src/homework3/level_1/3.ts:15:55
 ) => FIXME<T, K>;
 
 // eslint-disable-next-line @typescript-eslint/no-explicit-any
-export const omit: OmitFuncType = (obj, keyToOmit) => {
-  // eslint-disable-next-line @typescript-eslint/no-unused-vars
-  const { [keyToOmit]: _, ...withoutKey } = obj;
-  return withoutKey;
-};
+export const omit: OmitFuncType = (obj, keyToOmit) => {};
 
