[NoCoverage] BlockStatement
src/homework3/level_2/1.ts:77:73
 //       fullfillmentDate: Date;
 //     };
 
-export const filterOnlyInitialAndInWorkOrder = (order: Order): FIXME => {
-  if (order.state === 'initial' || order.state === 'inWork') {
-    return order;
-  }
-
-  return null;
-};
+export const filterOnlyInitialAndInWorkOrder = (order: Order): FIXME => {};
 

[NoCoverage] EqualityOperator
src/homework3/level_2/1.ts:78:7
 //     };
 
 export const filterOnlyInitialAndInWorkOrder = (order: Order): FIXME => {
-  if (order.state === 'initial' || order.state === 'inWork') {
+  if (order.state !== 'initial' || order.state === 'inWork') {
     return order;
   }

[NoCoverage] BlockStatement
src/homework3/level_2/1.ts:78:62
 //     };
 
 export const filterOnlyInitialAndInWorkOrder = (order: Order): FIXME => {
-  if (order.state === 'initial' || order.state === 'inWork') {
-    return order;
-  }
+  if (order.state === 'initial' || order.state === 'inWork') {}
 
   return null;
