[NoCoverage] BlockStatement
src/homework3/level_2/2.ts:16:16
 // Hint: infer
 export const getDefaultProps = <T>(
   component: React.ComponentType<T>
-): FIXME<T> => {
-  return component.defaultProps;
-};
+): FIXME<T> => {};
 
