[NoCoverage] ArrowFunction
src/homework3/level_2/3.ts:14:35
 type FIXME = Exclude<OrderState, 'buyingSupplies' | 'producing'>[];
 
 // Hint: type guards
-export const getUserOrderStates = (orderStates: OrderState[]): FIXME =>
-  orderStates.filter(
-    (state) => state !== 'buyingSupplies' && state !== 'producing'
-  ) as FIXME;
+export const getUserOrderStates = () => undefined;
 
