[NoCoverage] BlockStatement
modules/game/core/core.ts:41:80
   return getRandomMatrix(size, fill);
 };
 
-export const getNewSizeMatrix = (size: SizeProps, prevMatrix: Model): Model => {
-  const prevMatrixHeight = prevMatrix.length;
-  const prevMatrixWidth = prevMatrix[0].length;
-  const { width, height } = size;
-
-  if (width === prevMatrixWidth && height === prevMatrixHeight)
-    return prevMatrix;
-
-  return Array.from({ length: height }, (_, rowIndex) => {
-    return Array.from({ length: width }, (_, columnIndex) => {
-      const prevItem = prevMatrix[rowIndex]?.[columnIndex];
-
-      return prevItem === undefined ? CellState.DEAD : prevItem;
-    });
-  });
-};
+export const getNewSizeMatrix = (size: SizeProps, prevMatrix: Model): Model => {};
 
 export const createNewSizeMatrix = (

[NoCoverage] ConditionalExpression
modules/game/core/core.ts:46:36
   const prevMatrixWidth = prevMatrix[0].length;
   const { width, height } = size;
 
-  if (width === prevMatrixWidth && height === prevMatrixHeight)
+  if (width === prevMatrixWidth && false)
     return prevMatrix;
 

[NoCoverage] ConditionalExpression
modules/game/core/core.ts:46:36
   const prevMatrixWidth = prevMatrix[0].length;
   const { width, height } = size;
 
-  if (width === prevMatrixWidth && height === prevMatrixHeight)
+  if (width === prevMatrixWidth && true)
     return prevMatrix;
 

[NoCoverage] BlockStatement
modules/game/core/core.ts:49:58
   if (width === prevMatrixWidth && height === prevMatrixHeight)
     return prevMatrix;
 
-  return Array.from({ length: height }, (_, rowIndex) => {
-    return Array.from({ length: width }, (_, columnIndex) => {
-      const prevItem = prevMatrix[rowIndex]?.[columnIndex];
-
-      return prevItem === undefined ? CellState.DEAD : prevItem;
-    });
-  });
+  return Array.from({ length: height }, (_, rowIndex) => {});
 };
 

[NoCoverage] BlockStatement
modules/game/core/core.ts:50:62
     return prevMatrix;
 
   return Array.from({ length: height }, (_, rowIndex) => {
-    return Array.from({ length: width }, (_, columnIndex) => {
-      const prevItem = prevMatrix[rowIndex]?.[columnIndex];
-
-      return prevItem === undefined ? CellState.DEAD : prevItem;
-    });
+    return Array.from({ length: width }, (_, columnIndex) => {});
   });
 };

[NoCoverage] ObjectLiteral
modules/game/core/core.ts:50:23
     return prevMatrix;
 
   return Array.from({ length: height }, (_, rowIndex) => {
-    return Array.from({ length: width }, (_, columnIndex) => {
+    return Array.from({}, (_, columnIndex) => {
       const prevItem = prevMatrix[rowIndex]?.[columnIndex];
 

[NoCoverage] OptionalChaining
modules/game/core/core.ts:51:24
 
   return Array.from({ length: height }, (_, rowIndex) => {
     return Array.from({ length: width }, (_, columnIndex) => {
-      const prevItem = prevMatrix[rowIndex]?.[columnIndex];
+      const prevItem = prevMatrix[rowIndex][columnIndex];
 
       return prevItem === undefined ? CellState.DEAD : prevItem;

[NoCoverage] ConditionalExpression
modules/game/core/core.ts:53:14
     return Array.from({ length: width }, (_, columnIndex) => {
       const prevItem = prevMatrix[rowIndex]?.[columnIndex];
 
-      return prevItem === undefined ? CellState.DEAD : prevItem;
+      return true ? CellState.DEAD : prevItem;
     });
   });

[NoCoverage] ConditionalExpression
modules/game/core/core.ts:53:14
     return Array.from({ length: width }, (_, columnIndex) => {
       const prevItem = prevMatrix[rowIndex]?.[columnIndex];
 
-      return prevItem === undefined ? CellState.DEAD : prevItem;
+      return false ? CellState.DEAD : prevItem;
     });
   });

[NoCoverage] BlockStatement
modules/game/core/core.ts:61:13
 export const createNewSizeMatrix = (
   sizeType: BoardSize,
   prevMatrix: Model
-): Model => {
-  const size = BoardSizeValue[sizeType];
-
-  return getNewSizeMatrix(size, prevMatrix);
-};
+): Model => {};
 
 export const createZeroMatrix = (sizeType: BoardSize): Model => {

[Timeout] ArrowFunction
modules/game/core/core.ts:89:18
           prevGenMatrix,
           rowIndex,
           columnIndex
-        ).filter((item) => item === CellState.ALIVE).length;
+        ).filter(() => undefined).length;
 
         if (

[Timeout] EqualityOperator
modules/game/core/core.ts:93:11
 
         if (
           currentItem === CellState.DEAD &&
-          aliveNeighboursLength === NEIGHBOURS_AMOUNT_TO_BORN_NEW_ITEM
+          aliveNeighboursLength !== NEIGHBOURS_AMOUNT_TO_BORN_NEW_ITEM
         ) {
           return CellState.ALIVE;

[Timeout] LogicalOperator
modules/game/core/core.ts:99:11
         }
 
         if (
-          currentItem === CellState.ALIVE &&
-          (aliveNeighboursLength < MIN_NEIGHBOURS_AMOUNT_TO_STAY_ALIVE ||
-            aliveNeighboursLength > MAX_NEIGHBOURS_AMOUNT_TO_STAY_ALIVE)
+          currentItem === CellState.ALIVE || aliveNeighboursLength < MIN_NEIGHBOURS_AMOUNT_TO_STAY_ALIVE || aliveNeighboursLength > MAX_NEIGHBOURS_AMOUNT_TO_STAY_ALIVE
         ) {
           return CellState.DEAD;

[Timeout] EqualityOperator
modules/game/core/core.ts:100:12
 
         if (
           currentItem === CellState.ALIVE &&
-          (aliveNeighboursLength < MIN_NEIGHBOURS_AMOUNT_TO_STAY_ALIVE ||
+          (aliveNeighboursLength <= MIN_NEIGHBOURS_AMOUNT_TO_STAY_ALIVE ||
             aliveNeighboursLength > MAX_NEIGHBOURS_AMOUNT_TO_STAY_ALIVE)
         ) {

[Timeout] ConditionalExpression
modules/game/core/core.ts:101:13
         if (
           currentItem === CellState.ALIVE &&
           (aliveNeighboursLength < MIN_NEIGHBOURS_AMOUNT_TO_STAY_ALIVE ||
-            aliveNeighboursLength > MAX_NEIGHBOURS_AMOUNT_TO_STAY_ALIVE)
+            true)
         ) {
           return CellState.DEAD;
