[Killed] BlockStatement
otus-reactjs/src/homework6/immutability.ts:16:20
 
 export const originalTeamToExpectedTeam1 = (
   originalTeam: OriginalTeam
-): ExpectedTeam => {
-  return Object.assign(
-    {},
-    { league: originalTeam.league, name: 'New York Badgers', roster: 25 }
-  );
-};
+): ExpectedTeam => {};
 
 // Задание 2
killedBy: team to team
statusReason: Error: expect(received).toEqual(expected) // deep equality

Expected: {"league": "Minor", "name": "New York Badgers", "roster": 25}
Received: undefined

[Killed] BlockStatement
otus-reactjs/src/homework6/immutability.ts:28:17
 
 export const originalArrayToExpectedArray = (
   originalArray: SomeArray
-): SomeArray => {
-  return (['two'] as SomeArray).concat(originalArray.slice(2), 5);
-};
+): SomeArray => {};
 
 // Задание 3
killedBy: array to array
statusReason: Error: expect(received).toEqual(expected) // deep equality

Expected: ["two", 3, 4, 5]
Received: undefined

[Killed] BlockStatement
otus-reactjs/src/homework6/immutability.ts:42:74
   };
 };
 
-export const originalTeamToExpectedTeam2 = (originalTeam: Team): Team => {
-  const keys = Object.keys(originalTeam);
-
-  return keys.reduce((acc, key) => {
-    if (key === 'captain') {
-      const obj = originalTeam.captain;
-
-      acc['captain'] = Object.assign({}, obj, {
-        age: obj.age + 1,
-      });
-    } else {
-      acc[key as keyof Omit<Team, 'captain'>] =
-        originalTeam[key as keyof Omit<Team, 'captain'>];
-    }
-
-    return acc;
-  }, {} as Team);
-};
+export const originalTeamToExpectedTeam2 = (originalTeam: Team): Team => {};
 
killedBy: team to team deep
statusReason: Error: expect(received).toEqual(expected) // deep equality

Expected: {"captain": {"age": 28, "name": "Bryan Downey"}, "name": "Tampa Bay Roosters"}
Received: undefined

[Killed] BlockStatement
otus-reactjs/src/homework6/immutability.ts:45:36
 export const originalTeamToExpectedTeam2 = (originalTeam: Team): Team => {
   const keys = Object.keys(originalTeam);
 
-  return keys.reduce((acc, key) => {
-    if (key === 'captain') {
-      const obj = originalTeam.captain;
-
-      acc['captain'] = Object.assign({}, obj, {
-        age: obj.age + 1,
-      });
-    } else {
-      acc[key as keyof Omit<Team, 'captain'>] =
-        originalTeam[key as keyof Omit<Team, 'captain'>];
-    }
-
-    return acc;
-  }, {} as Team);
+  return keys.reduce((acc, key) => {}, {} as Team);
 };
 
killedBy: team to team deep
statusReason: Error: expect(received).toEqual(expected) // deep equality

Expected: {"captain": {"age": 28, "name": "Bryan Downey"}, "name": "Tampa Bay Roosters"}
Received: undefined

[Killed] BlockStatement
otus-reactjs/src/homework6/immutability.ts:46:28
   const keys = Object.keys(originalTeam);
 
   return keys.reduce((acc, key) => {
-    if (key === 'captain') {
-      const obj = originalTeam.captain;
-
-      acc['captain'] = Object.assign({}, obj, {
-        age: obj.age + 1,
-      });
-    } else {
+    if (key === 'captain') {} else {
       acc[key as keyof Omit<Team, 'captain'>] =
         originalTeam[key as keyof Omit<Team, 'captain'>];
killedBy: team to team deep
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 4
+ Received  + 0

  Object {
-   "captain": Object {
-     "age": 28,

[Killed] EqualityOperator
otus-reactjs/src/homework6/immutability.ts:46:9
   const keys = Object.keys(originalTeam);
 
   return keys.reduce((acc, key) => {
-    if (key === 'captain') {
+    if (key !== 'captain') {
       const obj = originalTeam.captain;
 
killedBy: team to team deep
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 2
+ Received  + 1

  Object {
    "captain": Object {
-     "age": 28,

[Killed] ObjectLiteral
otus-reactjs/src/homework6/immutability.ts:49:47
     if (key === 'captain') {
       const obj = originalTeam.captain;
 
-      acc['captain'] = Object.assign({}, obj, {
-        age: obj.age + 1,
-      });
+      acc['captain'] = Object.assign({}, obj, {});
     } else {
       acc[key as keyof Omit<Team, 'captain'>] =
killedBy: team to team deep
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 1
+ Received  + 1

  Object {
    "captain": Object {
-     "age": 28,

[Killed] ArithmeticOperator
otus-reactjs/src/homework6/immutability.ts:50:14
       const obj = originalTeam.captain;
 
       acc['captain'] = Object.assign({}, obj, {
-        age: obj.age + 1,
+        age: obj.age - 1,
       });
     } else {
killedBy: team to team deep
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 1
+ Received  + 1

  Object {
    "captain": Object {
-     "age": 28,

[Killed] BlockStatement
otus-reactjs/src/homework6/immutability.ts:52:12
       acc['captain'] = Object.assign({}, obj, {
         age: obj.age + 1,
       });
-    } else {
-      acc[key as keyof Omit<Team, 'captain'>] =
-        originalTeam[key as keyof Omit<Team, 'captain'>];
-    }
+    } else {}
 
     return acc;
killedBy: team to team deep
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 1
+ Received  + 0

  Object {
    "captain": Object {
      "age": 28,
