[Killed] BlockStatement
otus-reactjs/src/homework6/pureFunctions.ts:4:54
 // Задание 1
 export type Team = { name: string; score: number };
 
-export const getTopName = (teams: Team[]): string => {
-  const maxScoreTeam = teams.reduce((acc, team) => {
-    if (team.score > acc.score) return team;
-
-    return acc;
-  });
-
-  return maxScoreTeam.name;
-};
+export const getTopName = (teams: Team[]): string => {};
 
 // Задание 2
killedBy: getTopName
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "Bears"
Received: undefined

[Killed] BlockStatement
otus-reactjs/src/homework6/pureFunctions.ts:5:52
 export type Team = { name: string; score: number };
 
 export const getTopName = (teams: Team[]): string => {
-  const maxScoreTeam = teams.reduce((acc, team) => {
-    if (team.score > acc.score) return team;
-
-    return acc;
-  });
+  const maxScoreTeam = teams.reduce((acc, team) => {});
 
   return maxScoreTeam.name;
killedBy: getTopName
statusReason: TypeError: Cannot read property 'name' of undefined

[Killed] EqualityOperator
otus-reactjs/src/homework6/pureFunctions.ts:6:9
 
 export const getTopName = (teams: Team[]): string => {
   const maxScoreTeam = teams.reduce((acc, team) => {
-    if (team.score > acc.score) return team;
+    if (team.score <= acc.score) return team;
 
     return acc;
killedBy: getTopName
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "Bears"
Received: "Monkeys"

[Killed] ConditionalExpression
otus-reactjs/src/homework6/pureFunctions.ts:6:9
 
 export const getTopName = (teams: Team[]): string => {
   const maxScoreTeam = teams.reduce((acc, team) => {
-    if (team.score > acc.score) return team;
+    if (true) return team;
 
     return acc;
killedBy: getTopName
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "Bears"
Received: "Monkeys"

[Killed] BlockStatement
otus-reactjs/src/homework6/pureFunctions.ts:17:51
 // Задание 2
 export type QsObj = Record<string, string | number | boolean>;
 
-export const createQs = (qsObj: QsObj): string => {
-  const items = Object.entries(qsObj).map(([key, value]) => `${key}=${value}`);
-
-  return `?${items.join('&')}`;
-};
+export const createQs = (qsObj: QsObj): string => {};
 
 // Задание 3
killedBy: createQs
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "?page=2&pageSize=10&total=205&somethingElse=value"
Received: undefined

[Killed] ArrowFunction
otus-reactjs/src/homework6/pureFunctions.ts:18:43
 export type QsObj = Record<string, string | number | boolean>;
 
 export const createQs = (qsObj: QsObj): string => {
-  const items = Object.entries(qsObj).map(([key, value]) => `${key}=${value}`);
+  const items = Object.entries(qsObj).map(() => undefined);
 
   return `?${items.join('&')}`;
killedBy: createQs
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "?page=2&pageSize=10&total=205&somethingElse=value"
Received: "?&&&"

[Killed] StringLiteral
otus-reactjs/src/homework6/pureFunctions.ts:20:10
 export const createQs = (qsObj: QsObj): string => {
   const items = Object.entries(qsObj).map(([key, value]) => `${key}=${value}`);
 
-  return `?${items.join('&')}`;
+  return ``;
 };
 
killedBy: createQs
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "?page=2&pageSize=10&total=205&somethingElse=value"
Received: ""

[Killed] BlockStatement
otus-reactjs/src/homework6/pureFunctions.ts:25:47
 
 // Задание 3
 
-export const parseQs = (qs: string): QsObj => {
-  return qs
-    .slice(1)
-    .split('&')
-    .reduce((acc, item) => {
-      const [key, value] = item.split('=');
-
-      acc[key] = value;
-
-      return acc;
-    }, {} as QsObj);
-};
+export const parseQs = (qs: string): QsObj => {};
 
killedBy: parseQs
statusReason: Error: expect(received).toEqual(expected) // deep equality

Expected: {"page": "2", "pageSize": "10", "somethingElse": "value", "total": "205"}
Received: undefined

[Killed] BlockStatement
otus-reactjs/src/homework6/pureFunctions.ts:29:28
   return qs
     .slice(1)
     .split('&')
-    .reduce((acc, item) => {
-      const [key, value] = item.split('=');
-
-      acc[key] = value;
-
-      return acc;
-    }, {} as QsObj);
+    .reduce((acc, item) => {}, {} as QsObj);
 };
 
killedBy: parseQs
statusReason: Error: expect(received).toEqual(expected) // deep equality

Expected: {"page": "2", "pageSize": "10", "somethingElse": "value", "total": "205"}
Received: undefined
