[Killed] ArrowFunction
otus-reactjs/src/homework6/ramdaPureFunctions.ts:17:32
 
 // Задание 1
 export type Team = { name: string; score: number };
-export const getMaxScoreTeam = (teams: Team[]): Team =>
-  reduce(
-    (acc, team) => (prop('score', team) > prop('score', acc) ? team : acc),
-    nth(0, teams) as Team,
-    slice(1, Infinity, teams)
-  );
+export const getMaxScoreTeam = () => undefined;
 
 export const getName = (team: Team): string => prop('name', team);
killedBy: getMaxScoreTeam
statusReason: Error: expect(received).toEqual(expected) // deep equality

Expected: {"name": "Bears", "score": 6}
Received: undefined

[Killed] ConditionalExpression
otus-reactjs/src/homework6/ramdaPureFunctions.ts:19:21
 export type Team = { name: string; score: number };
 export const getMaxScoreTeam = (teams: Team[]): Team =>
   reduce(
-    (acc, team) => (prop('score', team) > prop('score', acc) ? team : acc),
+    (acc, team) => (true ? team : acc),
     nth(0, teams) as Team,
     slice(1, Infinity, teams)
killedBy: getMaxScoreTeam
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 2
+ Received  + 2

  Object {
-   "name": "Bears",
-   "score": 6,

[Killed] ArrowFunction
otus-reactjs/src/homework6/ramdaPureFunctions.ts:19:5
 export type Team = { name: string; score: number };
 export const getMaxScoreTeam = (teams: Team[]): Team =>
   reduce(
-    (acc, team) => (prop('score', team) > prop('score', acc) ? team : acc),
+    () => undefined,
     nth(0, teams) as Team,
     slice(1, Infinity, teams)
killedBy: getMaxScoreTeam
statusReason: Error: expect(received).toEqual(expected) // deep equality

Expected: {"name": "Bears", "score": 6}
Received: undefined

[Killed] ArrowFunction
otus-reactjs/src/homework6/ramdaPureFunctions.ts:24:24
     slice(1, Infinity, teams)
   );
 
-export const getName = (team: Team): string => prop('name', team);
+export const getName = () => undefined;
 export const getTopName = compose(getName, getMaxScoreTeam);
 
killedBy: getName
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "Lions"
Received: undefined

[Killed] StringLiteral
otus-reactjs/src/homework6/ramdaPureFunctions.ts:24:53
     slice(1, Infinity, teams)
   );
 
-export const getName = (team: Team): string => prop('name', team);
+export const getName = (team: Team): string => prop("", team);
 export const getTopName = compose(getName, getMaxScoreTeam);
 
killedBy: getName
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "Lions"
Received: undefined

[Killed] ArrowFunction
otus-reactjs/src/homework6/ramdaPureFunctions.ts:32:25
 export type Pair = [string, string];
 export type Pairs = Pair[];
 
-export const joinPair = (pair: Pair): string => join('=', pair);
+export const joinPair = () => undefined;
 export const getQsItemsArr = (pairs: Pairs): string[] => map(joinPair, pairs);
 export const getQs = (items: string[]): string => `?${join('&', items)}`;
killedBy: joinPair
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "key=value"
Received: undefined

[Killed] ArrowFunction
otus-reactjs/src/homework6/ramdaPureFunctions.ts:33:30
 export type Pairs = Pair[];
 
 export const joinPair = (pair: Pair): string => join('=', pair);
-export const getQsItemsArr = (pairs: Pairs): string[] => map(joinPair, pairs);
+export const getQsItemsArr = () => undefined;
 export const getQs = (items: string[]): string => `?${join('&', items)}`;
 
killedBy: getQsItemsArr
statusReason: Error: expect(received).toEqual(expected) // deep equality

Expected: ["key1=value1", "key2=value2"]
Received: undefined

[Killed] ArrowFunction
otus-reactjs/src/homework6/ramdaPureFunctions.ts:34:22
 
 export const joinPair = (pair: Pair): string => join('=', pair);
 export const getQsItemsArr = (pairs: Pairs): string[] => map(joinPair, pairs);
-export const getQs = (items: string[]): string => `?${join('&', items)}`;
+export const getQs = () => undefined;
 
 export const createQs = compose(getQs, getQsItemsArr, toPairs);
killedBy: getQs
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "?key1=value1&key2=value2"
Received: undefined

[Killed] ArrowFunction
otus-reactjs/src/homework6/ramdaPureFunctions.ts:39:24
 export const createQs = compose(getQs, getQsItemsArr, toPairs);
 
 // Задание 3
-export const sliceQs = (str: string): string => slice(1, Infinity, str);
+export const sliceQs = () => undefined;
 export const getSplitedQs = (str: string): string[] => split('&', str);
 export const getObj = (items: string[]): QsObj => {
killedBy: sliceQs
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "someKey=someValue"
Received: undefined

[Killed] ArrowFunction
otus-reactjs/src/homework6/ramdaPureFunctions.ts:40:29
 
 // Задание 3
 export const sliceQs = (str: string): string => slice(1, Infinity, str);
-export const getSplitedQs = (str: string): string[] => split('&', str);
+export const getSplitedQs = () => undefined;
 export const getObj = (items: string[]): QsObj => {
   return reduce(
killedBy: getSplitedQs
statusReason: Error: expect(received).toEqual(expected) // deep equality

Expected: ["someKey=someValue", "key=value", "name=andrey"]
Received: undefined

[Killed] StringLiteral
otus-reactjs/src/homework6/ramdaPureFunctions.ts:40:62
 
 // Задание 3
 export const sliceQs = (str: string): string => slice(1, Infinity, str);
-export const getSplitedQs = (str: string): string[] => split('&', str);
+export const getSplitedQs = (str: string): string[] => split("", str);
 export const getObj = (items: string[]): QsObj => {
   return reduce(
killedBy: getSplitedQs
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  -  3
+ Received  + 39

  Array [
-   "someKey=someValue",
-   "key=value",

[Killed] BlockStatement
otus-reactjs/src/homework6/ramdaPureFunctions.ts:41:51
 // Задание 3
 export const sliceQs = (str: string): string => slice(1, Infinity, str);
 export const getSplitedQs = (str: string): string[] => split('&', str);
-export const getObj = (items: string[]): QsObj => {
-  return reduce(
-    (acc, item) => {
-      const pair = split('=', item);
-
-      return assoc(nth(0, pair) as string, last(pair), acc);
-    },
-    {} as QsObj,
-    items
-  );
-};
+export const getObj = (items: string[]): QsObj => {};
 export const parseQs = compose(getObj, getSplitedQs, sliceQs);
 
killedBy: getObj
statusReason: Error: expect(received).toEqual(expected) // deep equality

Expected: {"key": "value", "name": "andrey", "someKey": "someValue"}
Received: undefined

[Killed] BlockStatement
otus-reactjs/src/homework6/ramdaPureFunctions.ts:43:20
 export const getSplitedQs = (str: string): string[] => split('&', str);
 export const getObj = (items: string[]): QsObj => {
   return reduce(
-    (acc, item) => {
-      const pair = split('=', item);
-
-      return assoc(nth(0, pair) as string, last(pair), acc);
-    },
+    (acc, item) => {},
     {} as QsObj,
     items
killedBy: getObj
statusReason: Error: expect(received).toEqual(expected) // deep equality

Expected: {"key": "value", "name": "andrey", "someKey": "someValue"}
Received: undefined
