[Killed] BlockStatement
src/components/PrivateRoute/PrivateRoute.tsx:8:7
   children,
   user,
   ...rest
-}) => {
-  return (
-    <Route
-      {...rest}
-      render={({ location }) =>
-        user ? (
-          children
-        ) : (
-          <Redirect
-            to={{
-              pathname: '/login',
-              state: { from: location },
-            }}
-          />
-        )
-      }
-    />
-  );
-};
+}) => {};
 
killedBy: App renders correctly
statusReason: TestingLibraryElementError: Unable to find an element by: [data-testid="start-form"]

Ignored nodes: comments, <script />, <style />
<body>
  <div>
    <h1>
      Something went wrong.
    </h1>

[Killed] ArrowFunction
src/components/PrivateRoute/PrivateRoute.tsx:12:15
   return (
     <Route
       {...rest}
-      render={({ location }) =>
-        user ? (
-          children
-        ) : (
-          <Redirect
-            to={{
-              pathname: '/login',
-              state: { from: location },
-            }}
-          />
-        )
+      render={() => undefined
       }
     />
killedBy: App signs in and signs out correctly
statusReason: TestingLibraryElementError: Unable to find an element with the text: Hello, Andrey!. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, <script />, <style />
<body>
  <div />
</body>

[NoCoverage] ObjectLiteral
src/components/PrivateRoute/PrivateRoute.tsx:17:17
           children
         ) : (
           <Redirect
-            to={{
-              pathname: '/login',
-              state: { from: location },
-            }}
+            to={{}}
           />
         )

[NoCoverage] ObjectLiteral
src/components/PrivateRoute/PrivateRoute.tsx:19:22
           <Redirect
             to={{
               pathname: '/login',
-              state: { from: location },
+              state: {},
             }}
           />
