[Timeout] BlockStatement
src/modules/game/useGameLogicRedux.ts:68:50
   const zeroMatrix = useSelector<State, Model>(getZeroMatrix);
   const isPlaying = useSelector<State, boolean>(getIsPlaying);
 
-  const updateModel = useCallback((someModel) => {
-    dispatch(ModelActionCreator.setModel(someModel));
-  }, []);
+  const updateModel = useCallback((someModel) => {}, []);
 
   const clear = useCallback(() => {

[Timeout] BlockStatement
src/modules/game/useGameLogicRedux.ts:72:35
     dispatch(ModelActionCreator.setModel(someModel));
   }, []);
 
-  const clear = useCallback(() => {
-    pause();
-    updateModel(zeroMatrix);
-  }, [size]);
+  const clear = useCallback(() => {}, [size]);
 
   const play = useCallback(() => {

[Timeout] BlockStatement
src/modules/game/useGameLogicRedux.ts:77:34
     updateModel(zeroMatrix);
   }, [size]);
 
-  const play = useCallback(() => {
-    dispatch(IsPlayingActionCreator.startPlaying());
-  }, []);
+  const play = useCallback(() => {}, []);
   const pause = useCallback(() => {
     dispatch(IsPlayingActionCreator.stopPlaying());

[Timeout] BlockStatement
src/modules/game/useGameLogicRedux.ts:80:35
   const play = useCallback(() => {
     dispatch(IsPlayingActionCreator.startPlaying());
   }, []);
-  const pause = useCallback(() => {
-    dispatch(IsPlayingActionCreator.stopPlaying());
-  }, []);
+  const pause = useCallback(() => {}, []);
 
   const updateSize = useCallback((size: BoardSize): void => {

[Timeout] BlockStatement
src/modules/game/useGameLogicRedux.ts:84:61
     dispatch(IsPlayingActionCreator.stopPlaying());
   }, []);
 
-  const updateSize = useCallback((size: BoardSize): void => {
-    pause();
-    changeSize(size);
-  }, []);
+  const updateSize = useCallback((size: BoardSize): void => {}, []);
 
   const updateFill = useCallback((fill: FillType): void => {

[Timeout] BlockStatement
src/modules/game/useGameLogicRedux.ts:89:60
     changeSize(size);
   }, []);
 
-  const updateFill = useCallback((fill: FillType): void => {
-    pause();
-    changeFill(fill);
-  }, []);
+  const updateFill = useCallback((fill: FillType): void => {}, []);
 
   const intervalId: { current: number | null } = useRef(null);

[NoCoverage] BlockStatement
src/modules/game/useGameLogicRedux.ts:96:43
 
   const intervalId: { current: number | null } = useRef(null);
 
-  const gameIteration = useCallback(() => {
-    updateModel(nextGenModel);
-  }, [nextGenModel]);
+  const gameIteration = useCallback(() => {}, [nextGenModel]);
 
   const gameIterationRef: { current: () => void } = useRef(gameIteration);

[Timeout] ArrayDeclaration
src/modules/game/useGameLogicRedux.ts:98:6
 
   const gameIteration = useCallback(() => {
     updateModel(nextGenModel);
-  }, [nextGenModel]);
+  }, []);
 
   const gameIterationRef: { current: () => void } = useRef(gameIteration);

[Timeout] BlockStatement
src/modules/game/useGameLogicRedux.ts:102:19
 
   const gameIterationRef: { current: () => void } = useRef(gameIteration);
 
-  useEffect(() => {
-    gameIterationRef.current = gameIteration;
-  }, [model]);
+  useEffect(() => {}, [model]);
 
   useEffect(() => {

[Timeout] BlockStatement
src/modules/game/useGameLogicRedux.ts:106:19
     gameIterationRef.current = gameIteration;
   }, [model]);
 
-  useEffect(() => {
-    if (isPlaying) {
-      intervalId.current = window.setInterval(() => {
-        gameIterationRef.current();
-      }, SpeedValue[speed]);
-    } else if (!isPlaying && intervalId.current) {
-      clearInterval(intervalId.current);
-      intervalId.current = null;
-    }
-
-    return () => {
-      if (intervalId.current) {
-        clearInterval(intervalId.current);
-        intervalId.current = null;
-      }
-    };
-  }, [isPlaying, speed]);
+  useEffect(() => {}, [isPlaying, speed]);
 
   const onClickCell = useCallback(

[Timeout] BlockStatement
src/modules/game/useGameLogicRedux.ts:107:20
   }, [model]);
 
   useEffect(() => {
-    if (isPlaying) {
-      intervalId.current = window.setInterval(() => {
-        gameIterationRef.current();
-      }, SpeedValue[speed]);
-    } else if (!isPlaying && intervalId.current) {
+    if (isPlaying) {} else if (!isPlaying && intervalId.current) {
       clearInterval(intervalId.current);
       intervalId.current = null;

[Timeout] ConditionalExpression
src/modules/game/useGameLogicRedux.ts:107:9
   }, [model]);
 
   useEffect(() => {
-    if (isPlaying) {
+    if (false) {
       intervalId.current = window.setInterval(() => {
         gameIterationRef.current();

[NoCoverage] BlockStatement
src/modules/game/useGameLogicRedux.ts:108:53
 
   useEffect(() => {
     if (isPlaying) {
-      intervalId.current = window.setInterval(() => {
-        gameIterationRef.current();
-      }, SpeedValue[speed]);
+      intervalId.current = window.setInterval(() => {}, SpeedValue[speed]);
     } else if (!isPlaying && intervalId.current) {
       clearInterval(intervalId.current);

[Timeout] LogicalOperator
src/modules/game/useGameLogicRedux.ts:111:16
       intervalId.current = window.setInterval(() => {
         gameIterationRef.current();
       }, SpeedValue[speed]);
-    } else if (!isPlaying && intervalId.current) {
+    } else if (!isPlaying || intervalId.current) {
       clearInterval(intervalId.current);
       intervalId.current = null;

[Timeout] ConditionalExpression
src/modules/game/useGameLogicRedux.ts:111:16
       intervalId.current = window.setInterval(() => {
         gameIterationRef.current();
       }, SpeedValue[speed]);
-    } else if (!isPlaying && intervalId.current) {
+    } else if (false) {
       clearInterval(intervalId.current);
       intervalId.current = null;

[Timeout] BlockStatement
src/modules/game/useGameLogicRedux.ts:116:18
       intervalId.current = null;
     }
 
-    return () => {
-      if (intervalId.current) {
-        clearInterval(intervalId.current);
-        intervalId.current = null;
-      }
-    };
+    return () => {};
   }, [isPlaying, speed]);
 

[Timeout] ConditionalExpression
src/modules/game/useGameLogicRedux.ts:117:11
     }
 
     return () => {
-      if (intervalId.current) {
+      if (true) {
         clearInterval(intervalId.current);
         intervalId.current = null;

[Timeout] BlockStatement
src/modules/game/useGameLogicRedux.ts:117:31
     }
 
     return () => {
-      if (intervalId.current) {
-        clearInterval(intervalId.current);
-        intervalId.current = null;
-      }
+      if (intervalId.current) {}
     };
   }, [isPlaying, speed]);

[Timeout] ArrayDeclaration
src/modules/game/useGameLogicRedux.ts:122:6
         intervalId.current = null;
       }
     };
-  }, [isPlaying, speed]);
+  }, []);
 
   const onClickCell = useCallback(

[Timeout] BlockStatement
src/modules/game/useGameLogicRedux.ts:125:31
   }, [isPlaying, speed]);
 
   const onClickCell = useCallback(
-    (coords: Coords): void => {
-      const { x, y } = coords;
-      const newModel = model.map((row) => row.slice());
-      newModel[y][x] = model[y][x] ? 0 : 1;
-
-      updateModel(newModel);
-    },
+    (coords: Coords): void => {},
     [model]
   );

[Timeout] ArrowFunction
src/modules/game/useGameLogicRedux.ts:127:34
   const onClickCell = useCallback(
     (coords: Coords): void => {
       const { x, y } = coords;
-      const newModel = model.map((row) => row.slice());
+      const newModel = model.map(() => undefined);
       newModel[y][x] = model[y][x] ? 0 : 1;
 

[Timeout] ArrayDeclaration
src/modules/game/useGameLogicRedux.ts:132:5
 
       updateModel(newModel);
     },
-    [model]
+    []
   );
 
