[Killed] ArrowFunction
otus-reactjs/src/App/App.tsx:24:31
   const dispatch = useDispatch();
 
   const user = useSelector<State, UserType>(getUser);
-  const signout = useCallback(() => dispatch(UserActionCreator.signout()), []);
+  const signout = useCallback(() => undefined, []);
   const history = useHistory();
 
killedBy: App signs in and signs out correctly
statusReason: Error: expect(received).toBeNull()

Received: <span class="css-1b0a5un">Выйти</span>

[Killed] BlockStatement
otus-reactjs/src/App/App.tsx:27:19
   const signout = useCallback(() => dispatch(UserActionCreator.signout()), []);
   const history = useHistory();
 
-  useEffect(() => {
-    if (user) {
-      history.push('/');
-    } else {
-      history.push('/login');
-    }
-  }, [user]);
+  useEffect(() => {}, [user]);
 
   return (
killedBy: App renders correctly
statusReason: TestingLibraryElementError: Unable to find an element by: [data-testid="start-form"]

Ignored nodes: comments, <script />, <style />
<body>
  <div>
    <div
      class="css-1oskuwq"
    >

[Killed] BlockStatement
otus-reactjs/src/App/App.tsx:28:15
   const history = useHistory();
 
   useEffect(() => {
-    if (user) {
-      history.push('/');
-    } else {
+    if (user) {} else {
       history.push('/login');
     }
killedBy: App signs in and signs out correctly
statusReason: Error: expect(received).toBeNull()

Received: <form class="css-qztj7d" data-testid="start-form"><input class="css-1oh381d" data-testid="name-input" placeholder="Enter Your Name:" required="" value="" /><button class="css-som8ht">Start</button></form>

[Killed] ConditionalExpression
otus-reactjs/src/App/App.tsx:28:9
   const history = useHistory();
 
   useEffect(() => {
-    if (user) {
+    if (false) {
       history.push('/');
     } else {
killedBy: App signs in and signs out correctly
statusReason: Error: expect(received).toBeNull()

Received: <form class="css-qztj7d" data-testid="start-form"><input class="css-1oh381d" data-testid="name-input" placeholder="Enter Your Name:" required="" value="" /><button class="css-som8ht">Start</button></form>

[Survived] StringLiteral
otus-reactjs/src/App/App.tsx:29:20
 
   useEffect(() => {
     if (user) {
-      history.push('/');
+      history.push("");
     } else {
       history.push('/login');

[Killed] BlockStatement
otus-reactjs/src/App/App.tsx:30:12
   useEffect(() => {
     if (user) {
       history.push('/');
-    } else {
-      history.push('/login');
-    }
+    } else {}
   }, [user]);
 
killedBy: App renders correctly
statusReason: TestingLibraryElementError: Unable to find an element by: [data-testid="start-form"]

Ignored nodes: comments, <script />, <style />
<body>
  <div>
    <div
      class="css-1oskuwq"
    >

[Killed] BlockStatement
otus-reactjs/src/App/App.tsx:47:30
   );
 };
 
-export const App: FC = () => {
-  return (
-    <ErrorBoundary>
-      <Router>
-        <AppRoutes />
-      </Router>
-    </ErrorBoundary>
-  );
-};
+export const App: FC = () => {};
 
killedBy: App renders correctly
statusReason: Error: App(...): Nothing was returned from render. This usually means a return statement is missing. Or, to render nothing, return null.
