[Timeout] BlockStatement
src/components/Button/Button.tsx:33:58
   font-size: 16px;
   line-height: 22px;
   font-family: Arial, Helvetica, sans-serif;
-  color: ${(props: Omit<ButtonProps, 'clickHandler'>) => {
-    if (props.isActive) {
-      return '#ffffff';
-    }
-
-    return props.isDisabled ? '#8c8c8c' : '#058aba';
-  }};
+  color: ${(props: Omit<ButtonProps, 'clickHandler'>) => {}};
   text-align: center;
   border: ${(props: Omit<ButtonProps, 'clickHandler'>) => {

[Timeout] BlockStatement
src/components/Button/Button.tsx:34:25
   line-height: 22px;
   font-family: Arial, Helvetica, sans-serif;
   color: ${(props: Omit<ButtonProps, 'clickHandler'>) => {
-    if (props.isActive) {
-      return '#ffffff';
-    }
+    if (props.isActive) {}
 
     return props.isDisabled ? '#8c8c8c' : '#058aba';

[Timeout] ConditionalExpression
src/components/Button/Button.tsx:34:9
   line-height: 22px;
   font-family: Arial, Helvetica, sans-serif;
   color: ${(props: Omit<ButtonProps, 'clickHandler'>) => {
-    if (props.isActive) {
+    if (true) {
       return '#ffffff';
     }

[Timeout] StringLiteral
src/components/Button/Button.tsx:38:43
       return '#ffffff';
     }
 
-    return props.isDisabled ? '#8c8c8c' : '#058aba';
+    return props.isDisabled ? '#8c8c8c' : "";
   }};
   text-align: center;

[Timeout] BlockStatement
src/components/Button/Button.tsx:41:59
     return props.isDisabled ? '#8c8c8c' : '#058aba';
   }};
   text-align: center;
-  border: ${(props: Omit<ButtonProps, 'clickHandler'>) => {
-    if (props.isActive) {
-      return 'none';
-    }
-
-    return `2px solid ${props.isDisabled ? '#8c8c8c' : '#058aba'}`;
-  }};
+  border: ${(props: Omit<ButtonProps, 'clickHandler'>) => {}};
   border-radius: 6px;
   background-color: ${(props: Omit<ButtonProps, 'clickHandler'>) =>

[Timeout] ConditionalExpression
src/components/Button/Button.tsx:42:9
   }};
   text-align: center;
   border: ${(props: Omit<ButtonProps, 'clickHandler'>) => {
-    if (props.isActive) {
+    if (true) {
       return 'none';
     }

[Timeout] ConditionalExpression
src/components/Button/Button.tsx:42:9
   }};
   text-align: center;
   border: ${(props: Omit<ButtonProps, 'clickHandler'>) => {
-    if (props.isActive) {
+    if (false) {
       return 'none';
     }

[Timeout] StringLiteral
src/components/Button/Button.tsx:46:44
       return 'none';
     }
 
-    return `2px solid ${props.isDisabled ? '#8c8c8c' : '#058aba'}`;
+    return `2px solid ${props.isDisabled ? "" : '#058aba'}`;
   }};
   border-radius: 6px;

[Timeout] ArrowFunction
src/components/Button/Button.tsx:49:23
     return `2px solid ${props.isDisabled ? '#8c8c8c' : '#058aba'}`;
   }};
   border-radius: 6px;
-  background-color: ${(props: Omit<ButtonProps, 'clickHandler'>) =>
-    props.isActive ? '#058aba' : 'transparent'};
+  background-color: ${() => undefined};
   pointer-events: ${(props: Omit<ButtonProps, 'clickHandler'>) =>
     props.isDisabled ? 'none' : 'auto'};

[Timeout] StringLiteral
src/components/Button/Button.tsx:50:22
   }};
   border-radius: 6px;
   background-color: ${(props: Omit<ButtonProps, 'clickHandler'>) =>
-    props.isActive ? '#058aba' : 'transparent'};
+    props.isActive ? "" : 'transparent'};
   pointer-events: ${(props: Omit<ButtonProps, 'clickHandler'>) =>
     props.isDisabled ? 'none' : 'auto'};

[Timeout] StringLiteral
src/components/Button/Button.tsx:50:34
   }};
   border-radius: 6px;
   background-color: ${(props: Omit<ButtonProps, 'clickHandler'>) =>
-    props.isActive ? '#058aba' : 'transparent'};
+    props.isActive ? '#058aba' : ""};
   pointer-events: ${(props: Omit<ButtonProps, 'clickHandler'>) =>
     props.isDisabled ? 'none' : 'auto'};

[Timeout] ArrowFunction
src/components/Button/Button.tsx:51:21
   border-radius: 6px;
   background-color: ${(props: Omit<ButtonProps, 'clickHandler'>) =>
     props.isActive ? '#058aba' : 'transparent'};
-  pointer-events: ${(props: Omit<ButtonProps, 'clickHandler'>) =>
-    props.isDisabled ? 'none' : 'auto'};
+  pointer-events: ${() => undefined};
   cursor: pointer;
 

[Timeout] ArrowFunction
src/components/Button/Button.tsx:56:25
   cursor: pointer;
 
   &:hover {
-    background-color: ${(props: Omit<ButtonProps, 'clickHandler'>) =>
-      props.isActive ? '#006C93' : 'rgba(255, 255, 255, 0.1)'};
+    background-color: ${() => undefined};
   }
 `;

[Timeout] StringLiteral
src/components/Button/Button.tsx:57:24
 
   &:hover {
     background-color: ${(props: Omit<ButtonProps, 'clickHandler'>) =>
-      props.isActive ? '#006C93' : 'rgba(255, 255, 255, 0.1)'};
+      props.isActive ? "" : 'rgba(255, 255, 255, 0.1)'};
   }
 `;

[Timeout] BlockStatement
src/components/Button/Button.tsx:66:7
   isDisabled,
   clickHandler,
   children,
-}) => {
-  return (
-    <ButtonItem
-      isDisabled={isDisabled}
-      isActive={isActive}
-      onClick={clickHandler}
-    >
-      {children}
-    </ButtonItem>
-  );
-};
+}) => {};
 
