[Killed] BlockStatement
src/components/ErrorBoundary/ErrorBoundary.tsx:14:44
 export class ErrorBoundary extends Component<Props, State> {
   state = { hasError: false };
 
-  static getDerivedStateFromError(): State {
-    // Update state so the next render will show the fallback UI.
-    return { hasError: true };
-  }
+  static getDerivedStateFromError(): State {}
 
   componentDidCatch(error: Error, errorInfo: unknown): void {
killedBy: ErrorBoundary test Render ErrorMsgComponent Fallback if error
statusReason: Error: Error!

[Killed] BooleanLiteral
src/components/ErrorBoundary/ErrorBoundary.tsx:16:24
 
   static getDerivedStateFromError(): State {
     // Update state so the next render will show the fallback UI.
-    return { hasError: true };
+    return { hasError: false };
   }
 
killedBy: ErrorBoundary test Render ErrorMsgComponent Fallback if error
statusReason: Error: Error!

[Survived] BlockStatement
src/components/ErrorBoundary/ErrorBoundary.tsx:19:61
     return { hasError: true };
   }
 
-  componentDidCatch(error: Error, errorInfo: unknown): void {
-    // You can also log the error to an error reporting service
-    console.error(error, errorInfo);
-  }
+  componentDidCatch(error: Error, errorInfo: unknown): void {}
 
   render(): ReactNode {

[Killed] BlockStatement
src/components/ErrorBoundary/ErrorBoundary.tsx:24:23
     console.error(error, errorInfo);
   }
 
-  render(): ReactNode {
-    if (this.state.hasError) {
-      // You can render any custom fallback UI
-      return <h1>Something went wrong.</h1>;
-    }
-
-    return this.props.children;
-  }
+  render(): ReactNode {}
 }
 
killedBy: ErrorBoundary test Render ErrorMsgComponent Fallback if error
statusReason: Error: ErrorBoundary(...): Nothing was returned from render. This usually means a return statement is missing. Or, to render nothing, return null.

[Killed] BlockStatement
src/components/ErrorBoundary/ErrorBoundary.tsx:25:30
   }
 
   render(): ReactNode {
-    if (this.state.hasError) {
-      // You can render any custom fallback UI
-      return <h1>Something went wrong.</h1>;
-    }
+    if (this.state.hasError) {}
 
     return this.props.children;
killedBy: ErrorBoundary test Render ErrorMsgComponent Fallback if error
statusReason: Error: Error!

[Killed] ConditionalExpression
src/components/ErrorBoundary/ErrorBoundary.tsx:25:9
   }
 
   render(): ReactNode {
-    if (this.state.hasError) {
+    if (true) {
       // You can render any custom fallback UI
       return <h1>Something went wrong.</h1>;
killedBy: App renders correctly
statusReason: TestingLibraryElementError: Unable to find an element by: [data-testid="start-form"]

Ignored nodes: comments, <script />, <style />
<body>
  <div>
    <h1>
      Something went wrong.
    </h1>
