[Timeout] StringLiteral
src/components/Game/Bar.tsx:80:32
   }
 `;
 
-const BarRowTitle = styled.span`
-  font-size: 20px;
-  line-height: 23px;
-  font-family: Courier;
-  color: #ffffff;
-  text-align: left;
-`;
+const BarRowTitle = styled.span``;
 
 const BarRowItem = styled.div`

[Timeout] StringLiteral
src/components/Game/Bar.tsx:97:27
   }
 `;
 
-const BarItem = styled.div`
-  box-sizing: border-box;
-  display: flex;
-  flex-direction: column;
-  width: 632px;
-  padding: 10px 15px;
-  background-color: #021a60;
-  border-radius: 0 0 10px 10px;
-`;
+const BarItem = styled.div``;
 
 export const Bar: FC<BarProps> = (props) => {

[Timeout] BlockStatement
src/components/Game/Bar.tsx:121:47
     changeFillType,
   } = props;
 
-  const sizeButtons = sizes.map((sizeType) => {
-    const { width, height } = BoardSizeValue[sizeType];
-    const text = `Size: ${width}x${height}`;
-    const name = `size-${sizeType}`;
-
-    return (
-      <Button
-        key={name}
-        isActive={sizeType === size}
-        isDisabled={sizeType === size}
-        clickHandler={() => changeSizeHandler(sizeType)}
-      >
-        {text}
-      </Button>
-    );
-  });
+  const sizeButtons = sizes.map((sizeType) => {});
 
   const speedButtons = speedTypes.map((speedType) => {

[Timeout] StringLiteral
src/components/Game/Bar.tsx:124:18
   const sizeButtons = sizes.map((sizeType) => {
     const { width, height } = BoardSizeValue[sizeType];
     const text = `Size: ${width}x${height}`;
-    const name = `size-${sizeType}`;
+    const name = ``;
 
     return (

[Timeout] ConditionalExpression
src/components/Game/Bar.tsx:129:19
     return (
       <Button
         key={name}
-        isActive={sizeType === size}
+        isActive={true}
         isDisabled={sizeType === size}
         clickHandler={() => changeSizeHandler(sizeType)}

[Timeout] EqualityOperator
src/components/Game/Bar.tsx:129:19
     return (
       <Button
         key={name}
-        isActive={sizeType === size}
+        isActive={sizeType !== size}
         isDisabled={sizeType === size}
         clickHandler={() => changeSizeHandler(sizeType)}

[Timeout] ConditionalExpression
src/components/Game/Bar.tsx:130:21
       <Button
         key={name}
         isActive={sizeType === size}
-        isDisabled={sizeType === size}
+        isDisabled={false}
         clickHandler={() => changeSizeHandler(sizeType)}
       >

[Timeout] EqualityOperator
src/components/Game/Bar.tsx:130:21
       <Button
         key={name}
         isActive={sizeType === size}
-        isDisabled={sizeType === size}
+        isDisabled={sizeType !== size}
         clickHandler={() => changeSizeHandler(sizeType)}
       >

[Timeout] ArrowFunction
src/components/Game/Bar.tsx:131:23
         key={name}
         isActive={sizeType === size}
         isDisabled={sizeType === size}
-        clickHandler={() => changeSizeHandler(sizeType)}
+        clickHandler={() => undefined}
       >
         {text}

[Timeout] BlockStatement
src/components/Game/Bar.tsx:138:54
     );
   });
 
-  const speedButtons = speedTypes.map((speedType) => {
-    const name = `speed-${speedType}`;
-
-    return (
-      <Button
-        key={name}
-        isActive={speedType === speed}
-        isDisabled={speedType === speed}
-        clickHandler={() => changeSpeedHandler(speedType)}
-      >
-        {speedType}
-      </Button>
-    );
-  });
+  const speedButtons = speedTypes.map((speedType) => {});
 
   const fillButtons = fillTypes.map((fillType) => {

[Timeout] ConditionalExpression
src/components/Game/Bar.tsx:144:19
     return (
       <Button
         key={name}
-        isActive={speedType === speed}
+        isActive={true}
         isDisabled={speedType === speed}
         clickHandler={() => changeSpeedHandler(speedType)}

[Timeout] ConditionalExpression
src/components/Game/Bar.tsx:144:19
     return (
       <Button
         key={name}
-        isActive={speedType === speed}
+        isActive={false}
         isDisabled={speedType === speed}
         clickHandler={() => changeSpeedHandler(speedType)}

[Timeout] EqualityOperator
src/components/Game/Bar.tsx:145:21
       <Button
         key={name}
         isActive={speedType === speed}
-        isDisabled={speedType === speed}
+        isDisabled={speedType !== speed}
         clickHandler={() => changeSpeedHandler(speedType)}
       >

[Timeout] ConditionalExpression
src/components/Game/Bar.tsx:145:21
       <Button
         key={name}
         isActive={speedType === speed}
-        isDisabled={speedType === speed}
+        isDisabled={false}
         clickHandler={() => changeSpeedHandler(speedType)}
       >

[Timeout] ArrowFunction
src/components/Game/Bar.tsx:146:23
         key={name}
         isActive={speedType === speed}
         isDisabled={speedType === speed}
-        clickHandler={() => changeSpeedHandler(speedType)}
+        clickHandler={() => undefined}
       >
         {speedType}

[Timeout] BlockStatement
src/components/Game/Bar.tsx:153:51
     );
   });
 
-  const fillButtons = fillTypes.map((fillType) => {
-    const percentage = BoardFillPercentage[fillType];
-    const text = `${percentage * 100}%`;
-    const name = `fill-${fillType}`;
-
-    return (
-      <Button
-        key={name}
-        isActive={fillType === fill}
-        clickHandler={() => changeFillType(fillType)}
-      >
-        {text}
-      </Button>
-    );
-  });
+  const fillButtons = fillTypes.map((fillType) => {});
 
   const controlsButtons = [Controls.PLAY, Controls.PAUSE, Controls.CLEAR].map(

[Timeout] ArithmeticOperator
src/components/Game/Bar.tsx:155:21
 
   const fillButtons = fillTypes.map((fillType) => {
     const percentage = BoardFillPercentage[fillType];
-    const text = `${percentage * 100}%`;
+    const text = `${percentage / 100}%`;
     const name = `fill-${fillType}`;
 

[Timeout] StringLiteral
src/components/Game/Bar.tsx:156:18
   const fillButtons = fillTypes.map((fillType) => {
     const percentage = BoardFillPercentage[fillType];
     const text = `${percentage * 100}%`;
-    const name = `fill-${fillType}`;
+    const name = ``;
 
     return (

[Timeout] ConditionalExpression
src/components/Game/Bar.tsx:161:19
     return (
       <Button
         key={name}
-        isActive={fillType === fill}
+        isActive={true}
         clickHandler={() => changeFillType(fillType)}
       >

[Timeout] EqualityOperator
src/components/Game/Bar.tsx:161:19
     return (
       <Button
         key={name}
-        isActive={fillType === fill}
+        isActive={fillType !== fill}
         clickHandler={() => changeFillType(fillType)}
       >

[Timeout] ArrowFunction
src/components/Game/Bar.tsx:162:23
       <Button
         key={name}
         isActive={fillType === fill}
-        clickHandler={() => changeFillType(fillType)}
+        clickHandler={() => undefined}
       >
         {text}

[Timeout] BlockStatement
src/components/Game/Bar.tsx:170:22
   });
 
   const controlsButtons = [Controls.PLAY, Controls.PAUSE, Controls.CLEAR].map(
-    (controlType) => {
-      const name = `control-${controlType}`;
-
-      return (
-        <Button
-          key={name}
-          isActive={
-            false ||
-            (controlType === Controls.PLAY && isPlaying) ||
-            (controlType === Controls.PAUSE && !isPlaying)
-          }
-          isDisabled={
-            false ||
-            (controlType === Controls.PLAY && isPlaying) ||
-            (controlType === Controls.PAUSE && !isPlaying)
-          }
-          clickHandler={() => props[controlType]()}
-        >
-          {controlType}
-        </Button>
-      );
-    }
+    (controlType) => {}
   );
 

[Timeout] LogicalOperator
src/components/Game/Bar.tsx:177:13
         <Button
           key={name}
           isActive={
-            false ||
-            (controlType === Controls.PLAY && isPlaying) ||
-            (controlType === Controls.PAUSE && !isPlaying)
+            (false || controlType === Controls.PLAY && isPlaying) && controlType === Controls.PAUSE && !isPlaying
           }
           isDisabled={

[Timeout] ConditionalExpression
src/components/Game/Bar.tsx:177:13
         <Button
           key={name}
           isActive={
-            false ||
-            (controlType === Controls.PLAY && isPlaying) ||
-            (controlType === Controls.PAUSE && !isPlaying)
+            true
           }
           isDisabled={

[Timeout] ConditionalExpression
src/components/Game/Bar.tsx:178:14
           key={name}
           isActive={
             false ||
-            (controlType === Controls.PLAY && isPlaying) ||
+            (false) ||
             (controlType === Controls.PAUSE && !isPlaying)
           }

[Timeout] ConditionalExpression
src/components/Game/Bar.tsx:178:14
           key={name}
           isActive={
             false ||
-            (controlType === Controls.PLAY && isPlaying) ||
+            (false && isPlaying) ||
             (controlType === Controls.PAUSE && !isPlaying)
           }

[Timeout] BooleanLiteral
src/components/Game/Bar.tsx:179:48
           isActive={
             false ||
             (controlType === Controls.PLAY && isPlaying) ||
-            (controlType === Controls.PAUSE && !isPlaying)
+            (controlType === Controls.PAUSE && isPlaying)
           }
           isDisabled={

[Timeout] ConditionalExpression
src/components/Game/Bar.tsx:179:14
           isActive={
             false ||
             (controlType === Controls.PLAY && isPlaying) ||
-            (controlType === Controls.PAUSE && !isPlaying)
+            (true)
           }
           isDisabled={

[Timeout] ConditionalExpression
src/components/Game/Bar.tsx:182:13
             (controlType === Controls.PAUSE && !isPlaying)
           }
           isDisabled={
-            false ||
-            (controlType === Controls.PLAY && isPlaying) ||
-            (controlType === Controls.PAUSE && !isPlaying)
+            false
           }
           clickHandler={() => props[controlType]()}

[Timeout] ConditionalExpression
src/components/Game/Bar.tsx:182:13
             (controlType === Controls.PAUSE && !isPlaying)
           }
           isDisabled={
-            false ||
-            (controlType === Controls.PLAY && isPlaying) ||
+            false ||
             (controlType === Controls.PAUSE && !isPlaying)
           }

[Timeout] ConditionalExpression
src/components/Game/Bar.tsx:183:14
           }
           isDisabled={
             false ||
-            (controlType === Controls.PLAY && isPlaying) ||
+            (true) ||
             (controlType === Controls.PAUSE && !isPlaying)
           }

[Timeout] ConditionalExpression
src/components/Game/Bar.tsx:183:14
           }
           isDisabled={
             false ||
-            (controlType === Controls.PLAY && isPlaying) ||
+            (true && isPlaying) ||
             (controlType === Controls.PAUSE && !isPlaying)
           }

[Timeout] ConditionalExpression
src/components/Game/Bar.tsx:184:14
           isDisabled={
             false ||
             (controlType === Controls.PLAY && isPlaying) ||
-            (controlType === Controls.PAUSE && !isPlaying)
+            (true && !isPlaying)
           }
           clickHandler={() => props[controlType]()}

[Timeout] ArrowFunction
src/components/Game/Bar.tsx:186:25
             (controlType === Controls.PLAY && isPlaying) ||
             (controlType === Controls.PAUSE && !isPlaying)
           }
-          clickHandler={() => props[controlType]()}
+          clickHandler={() => undefined}
         >
           {controlType}

[Timeout] StringLiteral
src/components/Game/Bar.tsx:196:14
 
   const compConfig = [
     { title: 'Board Size: ', buttons: sizeButtons },
-    { title: 'Sim Speed: ', buttons: speedButtons },
+    { title: "", buttons: speedButtons },
     { title: 'Fill: ', buttons: fillButtons },
     { title: 'Controls: ', buttons: controlsButtons },

[Timeout] ObjectLiteral
src/components/Game/Bar.tsx:196:5
 
   const compConfig = [
     { title: 'Board Size: ', buttons: sizeButtons },
-    { title: 'Sim Speed: ', buttons: speedButtons },
+    {},
     { title: 'Fill: ', buttons: fillButtons },
     { title: 'Controls: ', buttons: controlsButtons },

[Timeout] ObjectLiteral
src/components/Game/Bar.tsx:198:5
     { title: 'Board Size: ', buttons: sizeButtons },
     { title: 'Sim Speed: ', buttons: speedButtons },
     { title: 'Fill: ', buttons: fillButtons },
-    { title: 'Controls: ', buttons: controlsButtons },
+    {},
   ];
 

[Timeout] BlockStatement
src/components/Game/Bar.tsx:203:47
 
   return (
     <BarItem>
-      {compConfig.map(({ title, buttons }) => {
-        return (
-          <BarRowItem key={title}>
-            <BarRowTitle>{title}</BarRowTitle>
-            <ButtonsWrapper>{buttons}</ButtonsWrapper>
-          </BarRowItem>
-        );
-      })}
+      {compConfig.map(({ title, buttons }) => {})}
     </BarItem>
   );
