[Timeout] StringLiteral
src/components/Game/Cell.tsx:20:28
   clickHandler: ClickCellType;
 }
 
-const CellItem = styled.div`
-  flex-shrink: 0;
-  box-sizing: border-box;
-  display: inline-flex;
-  justify-content: center;
-  align-items: center;
-  width: 12px;
-  height: 12px;
-  background-color: ${(props: Pick<CellProps, 'isActive'>) =>
-    props.isActive ? '#000071' : 'transparent'};
-  background-color: ${(props: Pick<CellProps, 'isActive'>) =>
-    props.isActive ? '#F9FF00' : '#073081'};
-  border: 1px solid #dddddd;
-  border: 1px solid #021a60;
-  font-size: 8px;
-  line-height: 20px;
-  cursor: pointer;
-`;
+const CellItem = styled.div``;
 
 export const Cell: FC<CellProps> = ({ coords, isActive, clickHandler }) => {

[Timeout] ArrowFunction
src/components/Game/Cell.tsx:28:23
   align-items: center;
   width: 12px;
   height: 12px;
-  background-color: ${(props: Pick<CellProps, 'isActive'>) =>
-    props.isActive ? '#000071' : 'transparent'};
+  background-color: ${() => undefined};
   background-color: ${(props: Pick<CellProps, 'isActive'>) =>
     props.isActive ? '#F9FF00' : '#073081'};

[Timeout] StringLiteral
src/components/Game/Cell.tsx:29:34
   width: 12px;
   height: 12px;
   background-color: ${(props: Pick<CellProps, 'isActive'>) =>
-    props.isActive ? '#000071' : 'transparent'};
+    props.isActive ? '#000071' : ""};
   background-color: ${(props: Pick<CellProps, 'isActive'>) =>
     props.isActive ? '#F9FF00' : '#073081'};

[Timeout] ArrowFunction
src/components/Game/Cell.tsx:30:23
   height: 12px;
   background-color: ${(props: Pick<CellProps, 'isActive'>) =>
     props.isActive ? '#000071' : 'transparent'};
-  background-color: ${(props: Pick<CellProps, 'isActive'>) =>
-    props.isActive ? '#F9FF00' : '#073081'};
+  background-color: ${() => undefined};
   border: 1px solid #dddddd;
   border: 1px solid #021a60;

[Timeout] BlockStatement
src/components/Game/Cell.tsx:39:76
   cursor: pointer;
 `;
 
-export const Cell: FC<CellProps> = ({ coords, isActive, clickHandler }) => {
-  return (
-    <CellItem
-      data-testid='cell'
-      isActive={isActive}
-      onClick={() => clickHandler(coords)}
-    ></CellItem>
-  );
-};
+export const Cell: FC<CellProps> = ({ coords, isActive, clickHandler }) => {};
 

[Timeout] ArrowFunction
src/components/Game/Cell.tsx:44:16
     <CellItem
       data-testid='cell'
       isActive={isActive}
-      onClick={() => clickHandler(coords)}
+      onClick={() => undefined}
     ></CellItem>
   );
