[Timeout] ArrowFunction
src/components/Game/Field.tsx:29:20
   background-color: rgba(255, 255, 255, 0.5);
   border-radius: 8px;
   box-shadow: 0 0 0 16px #021a60;
-  border-radius: ${(props: Pick<FieldProps, 'size'>) =>
-    props.size === BoardSize.SMALL ? '8px 8px 0 0' : '8px'};
+  border-radius: ${() => undefined};
 `;
 

[Timeout] ConditionalExpression
src/components/Game/Field.tsx:30:5
   border-radius: 8px;
   box-shadow: 0 0 0 16px #021a60;
   border-radius: ${(props: Pick<FieldProps, 'size'>) =>
-    props.size === BoardSize.SMALL ? '8px 8px 0 0' : '8px'};
+    true ? '8px 8px 0 0' : '8px'};
 `;
 

[Timeout] EqualityOperator
src/components/Game/Field.tsx:30:5
   border-radius: 8px;
   box-shadow: 0 0 0 16px #021a60;
   border-radius: ${(props: Pick<FieldProps, 'size'>) =>
-    props.size === BoardSize.SMALL ? '8px 8px 0 0' : '8px'};
+    props.size !== BoardSize.SMALL ? '8px 8px 0 0' : '8px'};
 `;
 

[Timeout] BlockStatement
src/components/Game/Field.tsx:42:42
 
   return (
     <FieldWrapper size={size}>
-      {model.map((modelRow, rowIndex) => {
-        return (
-          <RowWrapper key={`index-${rowIndex}`}>
-            {modelRow.map((item, columnIndex) => {
-              const coords = { x: columnIndex, y: rowIndex };
-
-              return (
-                <Cell
-                  key={`index-${rowIndex}.${columnIndex}`}
-                  coords={coords}
-                  isActive={!!item}
-                  clickHandler={clickHandler}
-                />
-              );
-            })}
-          </RowWrapper>
-        );
-      })}
+      {model.map((modelRow, rowIndex) => {})}
     </FieldWrapper>
   );

[Timeout] StringLiteral
src/components/Game/Field.tsx:44:28
     <FieldWrapper size={size}>
       {model.map((modelRow, rowIndex) => {
         return (
-          <RowWrapper key={`index-${rowIndex}`}>
+          <RowWrapper key={``}>
             {modelRow.map((item, columnIndex) => {
               const coords = { x: columnIndex, y: rowIndex };

[Timeout] BlockStatement
src/components/Game/Field.tsx:45:50
       {model.map((modelRow, rowIndex) => {
         return (
           <RowWrapper key={`index-${rowIndex}`}>
-            {modelRow.map((item, columnIndex) => {
-              const coords = { x: columnIndex, y: rowIndex };
-
-              return (
-                <Cell
-                  key={`index-${rowIndex}.${columnIndex}`}
-                  coords={coords}
-                  isActive={!!item}
-                  clickHandler={clickHandler}
-                />
-              );
-            })}
+            {modelRow.map((item, columnIndex) => {})}
           </RowWrapper>
         );

[Timeout] ObjectLiteral
src/components/Game/Field.tsx:46:30
         return (
           <RowWrapper key={`index-${rowIndex}`}>
             {modelRow.map((item, columnIndex) => {
-              const coords = { x: columnIndex, y: rowIndex };
+              const coords = {};
 
               return (

[Timeout] StringLiteral
src/components/Game/Field.tsx:50:24
 
               return (
                 <Cell
-                  key={`index-${rowIndex}.${columnIndex}`}
+                  key={``}
                   coords={coords}
                   isActive={!!item}

[Timeout] BooleanLiteral
src/components/Game/Field.tsx:52:30
                 <Cell
                   key={`index-${rowIndex}.${columnIndex}`}
                   coords={coords}
-                  isActive={!!item}
+                  isActive={!item}
                   clickHandler={clickHandler}
                 />
