[Killed] BlockStatement
src/components/Header/Header.tsx:34:67
   signout: () => void;
 }
 
-export const Header: FC<HeaderPropsType> = ({ user, signout }) => {
-  return (
-    <Wrapper>
-      {user && (
-        <Title>
-          <span data-testid='user'>Hello, {user}! </span>
-          <LogoutItem onClick={signout}>Выйти</LogoutItem>
-        </Title>
-      )}
-    </Wrapper>
-  );
-};
+export const Header: FC<HeaderPropsType> = ({ user, signout }) => {};
 
killedBy: Header renders correctly
statusReason: Error: Header(...): Nothing was returned from render. This usually means a return statement is missing. Or, to render nothing, return null.

[Killed] LogicalOperator
src/components/Header/Header.tsx:37:8
 export const Header: FC<HeaderPropsType> = ({ user, signout }) => {
   return (
     <Wrapper>
-      {user && (
-        <Title>
-          <span data-testid='user'>Hello, {user}! </span>
-          <LogoutItem onClick={signout}>Выйти</LogoutItem>
-        </Title>
-      )}
+      {user || <Title>
+          <span data-testid='user'>Hello, {user}! </span>
+          <LogoutItem onClick={signout}>Выйти</LogoutItem>
+        </Title>}
     </Wrapper>
   );
killedBy: App signs in and signs out correctly
statusReason: TestingLibraryElementError: Unable to find an element with the text: Hello, Andrey!. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, <script />, <style />
<body>
  <div>
    <div
      class="css-1oskuwq"
    >

[Killed] ConditionalExpression
src/components/Header/Header.tsx:37:8
 export const Header: FC<HeaderPropsType> = ({ user, signout }) => {
   return (
     <Wrapper>
-      {user && (
-        <Title>
-          <span data-testid='user'>Hello, {user}! </span>
-          <LogoutItem onClick={signout}>Выйти</LogoutItem>
-        </Title>
-      )}
+      {false}
     </Wrapper>
   );
killedBy: Header renders correctly
statusReason: Error: expect(received).toMatchSnapshot()

Snapshot name: `Header renders correctly 1`

- Snapshot  - 16
+ Received  +  1

  <DocumentFragment>
