[Timeout] ArrayDeclaration
work/otus-reactjs/src/configs.ts:19:15
 }
 
 export const gameOptions = {
-  boardSizes: [BoardSize.SMALL, BoardSize.MEDIUM, BoardSize.LARGE],
+  boardSizes: [],
   speedTypes: [SpeedType.SLOW, SpeedType.MEDIUM, SpeedType.FAST],
   fillTypes: [FillType.LOW, FillType.MEDIUM, FillType.HIGH],

[Timeout] ArrayDeclaration
work/otus-reactjs/src/configs.ts:20:15
 
 export const gameOptions = {
   boardSizes: [BoardSize.SMALL, BoardSize.MEDIUM, BoardSize.LARGE],
-  speedTypes: [SpeedType.SLOW, SpeedType.MEDIUM, SpeedType.FAST],
+  speedTypes: [],
   fillTypes: [FillType.LOW, FillType.MEDIUM, FillType.HIGH],
 };

[Timeout] ArrayDeclaration
work/otus-reactjs/src/configs.ts:21:14
 export const gameOptions = {
   boardSizes: [BoardSize.SMALL, BoardSize.MEDIUM, BoardSize.LARGE],
   speedTypes: [SpeedType.SLOW, SpeedType.MEDIUM, SpeedType.FAST],
-  fillTypes: [FillType.LOW, FillType.MEDIUM, FillType.HIGH],
+  fillTypes: [],
 };
 
