[Timeout] ObjectLiteral
modules/game/core/core.ts:10:36
 import { FillType, BoardFillPercentage } from '@/modules/game/fill';
 import { Model, CellState } from '@/modules/game/model';
 
-export const GameCoreLogicConfig = {
-  NEIGHBOURS_AMOUNT_TO_BORN_NEW_ITEM: 3,
-  MIN_NEIGHBOURS_AMOUNT_TO_STAY_ALIVE: 2,
-  MAX_NEIGHBOURS_AMOUNT_TO_STAY_ALIVE: 3,
-};
+export const GameCoreLogicConfig = {};
 
 export const getRandomMatrix = (size: SizeProps, fill: number): Model => {

[Timeout] BlockStatement
modules/game/core/core.ts:16:74
   MAX_NEIGHBOURS_AMOUNT_TO_STAY_ALIVE: 3,
 };
 
-export const getRandomMatrix = (size: SizeProps, fill: number): Model => {
-  const { width, height } = size;
-  const maxValue = width * height;
-  const amount = Math.round(fill * maxValue);
-  const randomIndexes = getRandomValuesArr(maxValue, amount);
-
-  return Array.from({ length: height }, (_, rowIndex) => {
-    return Array.from({ length: width }, (_, columnIndex) => {
-      return randomIndexes.includes(rowIndex * width + columnIndex)
-        ? CellState.ALIVE
-        : CellState.DEAD;
-    });
-  });
-};
+export const getRandomMatrix = (size: SizeProps, fill: number): Model => {};
 
 export const createRandomMatrix = (

[Timeout] ArithmeticOperator
modules/game/core/core.ts:18:20
 
 export const getRandomMatrix = (size: SizeProps, fill: number): Model => {
   const { width, height } = size;
-  const maxValue = width * height;
+  const maxValue = width / height;
   const amount = Math.round(fill * maxValue);
   const randomIndexes = getRandomValuesArr(maxValue, amount);

[Timeout] ArithmeticOperator
modules/game/core/core.ts:19:29
 export const getRandomMatrix = (size: SizeProps, fill: number): Model => {
   const { width, height } = size;
   const maxValue = width * height;
-  const amount = Math.round(fill * maxValue);
+  const amount = Math.round(fill / maxValue);
   const randomIndexes = getRandomValuesArr(maxValue, amount);
 

[Timeout] BlockStatement
modules/game/core/core.ts:22:58
   const amount = Math.round(fill * maxValue);
   const randomIndexes = getRandomValuesArr(maxValue, amount);
 
-  return Array.from({ length: height }, (_, rowIndex) => {
-    return Array.from({ length: width }, (_, columnIndex) => {
-      return randomIndexes.includes(rowIndex * width + columnIndex)
-        ? CellState.ALIVE
-        : CellState.DEAD;
-    });
-  });
+  return Array.from({ length: height }, (_, rowIndex) => {});
 };
 

[Timeout] BlockStatement
modules/game/core/core.ts:23:62
   const randomIndexes = getRandomValuesArr(maxValue, amount);
 
   return Array.from({ length: height }, (_, rowIndex) => {
-    return Array.from({ length: width }, (_, columnIndex) => {
-      return randomIndexes.includes(rowIndex * width + columnIndex)
-        ? CellState.ALIVE
-        : CellState.DEAD;
-    });
+    return Array.from({ length: width }, (_, columnIndex) => {});
   });
 };

[Timeout] ArithmeticOperator
modules/game/core/core.ts:24:37
 
   return Array.from({ length: height }, (_, rowIndex) => {
     return Array.from({ length: width }, (_, columnIndex) => {
-      return randomIndexes.includes(rowIndex * width + columnIndex)
+      return randomIndexes.includes(rowIndex / width + columnIndex)
         ? CellState.ALIVE
         : CellState.DEAD;

[Timeout] ArithmeticOperator
modules/game/core/core.ts:24:37
 
   return Array.from({ length: height }, (_, rowIndex) => {
     return Array.from({ length: width }, (_, columnIndex) => {
-      return randomIndexes.includes(rowIndex * width + columnIndex)
+      return randomIndexes.includes(rowIndex * width - columnIndex)
         ? CellState.ALIVE
         : CellState.DEAD;

[Timeout] BlockStatement
modules/game/core/core.ts:34:13
 export const createRandomMatrix = (
   sizeType: BoardSize,
   fillType: FillType
-): Model => {
-  const size = BoardSizeValue[sizeType];
-  const fill = BoardFillPercentage[fillType];
-
-  return getRandomMatrix(size, fill);
-};
+): Model => {};
 
 export const createZeroMatrix = (sizeType: BoardSize): Model => {

[Timeout] BlockStatement
modules/game/core/core.ts:41:65
   return getRandomMatrix(size, fill);
 };
 
-export const createZeroMatrix = (sizeType: BoardSize): Model => {
-  const size = BoardSizeValue[sizeType];
-
-  return getZeroMatrix(size) as Model;
-};
+export const createZeroMatrix = (sizeType: BoardSize): Model => {};
 
 export const getNextGenMatrix = (prevGenMatrix: Model): Model => {

[Timeout] ObjectLiteral
modules/game/core/core.ts:56:7
 
   return Array.from({ length: prevGenMatrix.length }, (_, rowIndex) => {
     return Array.from(
-      { length: prevGenMatrix[rowIndex].length },
+      {},
       (_, columnIndex) => {
         const currentItem = prevGenMatrix[rowIndex][columnIndex];

[Timeout] BlockStatement
modules/game/core/core.ts:57:27
   return Array.from({ length: prevGenMatrix.length }, (_, rowIndex) => {
     return Array.from(
       { length: prevGenMatrix[rowIndex].length },
-      (_, columnIndex) => {
-        const currentItem = prevGenMatrix[rowIndex][columnIndex];
-        const aliveNeighboursLength = getMatrixItemNeighbours(
-          prevGenMatrix,
-          rowIndex,
-          columnIndex
-        ).filter((item) => item === CellState.ALIVE).length;
-
-        if (
-          currentItem === CellState.DEAD &&
-          aliveNeighboursLength === NEIGHBOURS_AMOUNT_TO_BORN_NEW_ITEM
-        ) {
-          return CellState.ALIVE;
-        }
-
-        if (
-          currentItem === CellState.ALIVE &&
-          (aliveNeighboursLength < MIN_NEIGHBOURS_AMOUNT_TO_STAY_ALIVE ||
-            aliveNeighboursLength > MAX_NEIGHBOURS_AMOUNT_TO_STAY_ALIVE)
-        ) {
-          return CellState.DEAD;
-        }
-
-        return currentItem;
-      }
+      (_, columnIndex) => {}
     );
   });

[Timeout] ConditionalExpression
modules/game/core/core.ts:63:28
           prevGenMatrix,
           rowIndex,
           columnIndex
-        ).filter((item) => item === CellState.ALIVE).length;
+        ).filter((item) => true).length;
 
         if (

[Timeout] EqualityOperator
modules/game/core/core.ts:63:28
           prevGenMatrix,
           rowIndex,
           columnIndex
-        ).filter((item) => item === CellState.ALIVE).length;
+        ).filter((item) => item !== CellState.ALIVE).length;
 
         if (

[Timeout] LogicalOperator
modules/game/core/core.ts:66:11
         ).filter((item) => item === CellState.ALIVE).length;
 
         if (
-          currentItem === CellState.DEAD &&
-          aliveNeighboursLength === NEIGHBOURS_AMOUNT_TO_BORN_NEW_ITEM
+          currentItem === CellState.DEAD || aliveNeighboursLength === NEIGHBOURS_AMOUNT_TO_BORN_NEW_ITEM
         ) {
           return CellState.ALIVE;

[Timeout] EqualityOperator
modules/game/core/core.ts:66:11
         ).filter((item) => item === CellState.ALIVE).length;
 
         if (
-          currentItem === CellState.DEAD &&
+          currentItem !== CellState.DEAD &&
           aliveNeighboursLength === NEIGHBOURS_AMOUNT_TO_BORN_NEW_ITEM
         ) {

[Timeout] ConditionalExpression
modules/game/core/core.ts:67:11
 
         if (
           currentItem === CellState.DEAD &&
-          aliveNeighboursLength === NEIGHBOURS_AMOUNT_TO_BORN_NEW_ITEM
+          false
         ) {
           return CellState.ALIVE;

[Timeout] ConditionalExpression
modules/game/core/core.ts:67:11
 
         if (
           currentItem === CellState.DEAD &&
-          aliveNeighboursLength === NEIGHBOURS_AMOUNT_TO_BORN_NEW_ITEM
+          true
         ) {
           return CellState.ALIVE;

[Timeout] BlockStatement
modules/game/core/core.ts:68:11
         if (
           currentItem === CellState.DEAD &&
           aliveNeighboursLength === NEIGHBOURS_AMOUNT_TO_BORN_NEW_ITEM
-        ) {
-          return CellState.ALIVE;
-        }
+        ) {}
 
         if (

[Timeout] ConditionalExpression
modules/game/core/core.ts:73:11
         }
 
         if (
-          currentItem === CellState.ALIVE &&
-          (aliveNeighboursLength < MIN_NEIGHBOURS_AMOUNT_TO_STAY_ALIVE ||
-            aliveNeighboursLength > MAX_NEIGHBOURS_AMOUNT_TO_STAY_ALIVE)
+          false
         ) {
           return CellState.DEAD;

[Timeout] ConditionalExpression
modules/game/core/core.ts:73:11
         }
 
         if (
-          currentItem === CellState.ALIVE &&
+          false &&
           (aliveNeighboursLength < MIN_NEIGHBOURS_AMOUNT_TO_STAY_ALIVE ||
             aliveNeighboursLength > MAX_NEIGHBOURS_AMOUNT_TO_STAY_ALIVE)

[Timeout] ConditionalExpression
modules/game/core/core.ts:74:12
 
         if (
           currentItem === CellState.ALIVE &&
-          (aliveNeighboursLength < MIN_NEIGHBOURS_AMOUNT_TO_STAY_ALIVE ||
-            aliveNeighboursLength > MAX_NEIGHBOURS_AMOUNT_TO_STAY_ALIVE)
+          (false)
         ) {
           return CellState.DEAD;

[Timeout] ConditionalExpression
modules/game/core/core.ts:74:12
 
         if (
           currentItem === CellState.ALIVE &&
-          (aliveNeighboursLength < MIN_NEIGHBOURS_AMOUNT_TO_STAY_ALIVE ||
+          (false ||
             aliveNeighboursLength > MAX_NEIGHBOURS_AMOUNT_TO_STAY_ALIVE)
         ) {

[Timeout] EqualityOperator
modules/game/core/core.ts:75:13
         if (
           currentItem === CellState.ALIVE &&
           (aliveNeighboursLength < MIN_NEIGHBOURS_AMOUNT_TO_STAY_ALIVE ||
-            aliveNeighboursLength > MAX_NEIGHBOURS_AMOUNT_TO_STAY_ALIVE)
+            aliveNeighboursLength <= MAX_NEIGHBOURS_AMOUNT_TO_STAY_ALIVE)
         ) {
           return CellState.DEAD;

[Timeout] ConditionalExpression
modules/game/core/core.ts:75:13
         if (
           currentItem === CellState.ALIVE &&
           (aliveNeighboursLength < MIN_NEIGHBOURS_AMOUNT_TO_STAY_ALIVE ||
-            aliveNeighboursLength > MAX_NEIGHBOURS_AMOUNT_TO_STAY_ALIVE)
+            false)
         ) {
           return CellState.DEAD;

[Timeout] BlockStatement
modules/game/core/core.ts:76:11
           currentItem === CellState.ALIVE &&
           (aliveNeighboursLength < MIN_NEIGHBOURS_AMOUNT_TO_STAY_ALIVE ||
             aliveNeighboursLength > MAX_NEIGHBOURS_AMOUNT_TO_STAY_ALIVE)
-        ) {
-          return CellState.DEAD;
-        }
+        ) {}
 
         return currentItem;
