[Timeout] ArrowFunction
modules/game/fill/fill.ts:25:14
   name: 'fill',
   initialState: FillType.MEDIUM,
   reducers: {
-    setFill: (_state: FillType, action: PayloadAction<FillType>) =>
-      action.payload,
+    setFill: () => undefined,
   },
 });
