[Timeout] ArrowFunction
modules/game/fill/selectors.ts:5:24
 import { State } from '@/reducer';
 import { FillType } from '.';
 
-export const getFill = (state: State): FillType => state[NAME_SPACE].fill;
+export const getFill = () => undefined;
 
