[Timeout] ObjectLiteral
src/modules/game/index.ts:20:33
   model: Model;
 }
 
-const reducer = combineReducers({
-  size: SizeReducer,
-  speed: SpeedReducer,
-  fill: FillReducer,
-  isPlaying: IsPlayingReducer,
-  model: ModelReducer,
-});
+const reducer = combineReducers({});
 
 export default reducer;
