[Timeout] BooleanLiteral
modules/game/isPlaying/isPlaying.ts:3:22
 import { createSlice, PayloadAction } from '@reduxjs/toolkit';
 
-const initialState = false;
+const initialState = true;
 
 const isPlayingSlice = createSlice({

[Timeout] ObjectLiteral
modules/game/isPlaying/isPlaying.ts:5:36
 
 const initialState = false;
 
-const isPlayingSlice = createSlice({
-  name: 'isPlaying',
-  initialState,
-  reducers: {
-    setPlaying: (_state, action: PayloadAction<boolean>) => action.payload,
-    startPlaying: () => true,
-    stopPlaying: () => false,
-  },
-});
+const isPlayingSlice = createSlice({});
 
 export const ActionCreator = isPlayingSlice.actions;

[Timeout] ObjectLiteral
modules/game/isPlaying/isPlaying.ts:8:13
 const isPlayingSlice = createSlice({
   name: 'isPlaying',
   initialState,
-  reducers: {
-    setPlaying: (_state, action: PayloadAction<boolean>) => action.payload,
-    startPlaying: () => true,
-    stopPlaying: () => false,
-  },
+  reducers: {},
 });
 

[Timeout] ArrowFunction
modules/game/isPlaying/isPlaying.ts:9:17
   name: 'isPlaying',
   initialState,
   reducers: {
-    setPlaying: (_state, action: PayloadAction<boolean>) => action.payload,
+    setPlaying: () => undefined,
     startPlaying: () => true,
     stopPlaying: () => false,

[Timeout] ArrowFunction
modules/game/isPlaying/isPlaying.ts:10:19
   initialState,
   reducers: {
     setPlaying: (_state, action: PayloadAction<boolean>) => action.payload,
-    startPlaying: () => true,
+    startPlaying: () => undefined,
     stopPlaying: () => false,
   },

[Timeout] BooleanLiteral
modules/game/isPlaying/isPlaying.ts:10:25
   initialState,
   reducers: {
     setPlaying: (_state, action: PayloadAction<boolean>) => action.payload,
-    startPlaying: () => true,
+    startPlaying: () => false,
     stopPlaying: () => false,
   },

[Timeout] BooleanLiteral
modules/game/isPlaying/isPlaying.ts:11:24
   reducers: {
     setPlaying: (_state, action: PayloadAction<boolean>) => action.payload,
     startPlaying: () => true,
-    stopPlaying: () => false,
+    stopPlaying: () => true,
   },
 });

[Timeout] ArrowFunction
modules/game/isPlaying/isPlaying.ts:11:18
   reducers: {
     setPlaying: (_state, action: PayloadAction<boolean>) => action.payload,
     startPlaying: () => true,
-    stopPlaying: () => false,
+    stopPlaying: () => undefined,
   },
 });
