[Timeout] ObjectLiteral
modules/game/model/model.ts:12:41
   ALIVE: Binary;
 }
 
-export const CellState: CellStateType = {
-  DEAD: 0,
-  ALIVE: 1,
-};
+export const CellState: CellStateType = {};
 
 const modelSlice = createSlice({

[Timeout] ObjectLiteral
modules/game/model/model.ts:17:32
   ALIVE: 1,
 };
 
-const modelSlice = createSlice({
-  name: 'model',
-  initialState: [[]] as Model,
-  reducers: {
-    setModel: (_state, action: PayloadAction<Model>) => action.payload,
-    resetModel: (_state, action: PayloadAction<BoardSize>) =>
-      createZeroMatrix(action.payload),
-  },
-});
+const modelSlice = createSlice({});
 
 export const ActionCreator = modelSlice.actions;

[Timeout] ObjectLiteral
modules/game/model/model.ts:20:13
 const modelSlice = createSlice({
   name: 'model',
   initialState: [[]] as Model,
-  reducers: {
-    setModel: (_state, action: PayloadAction<Model>) => action.payload,
-    resetModel: (_state, action: PayloadAction<BoardSize>) =>
-      createZeroMatrix(action.payload),
-  },
+  reducers: {},
 });
 

[Timeout] ArrowFunction
modules/game/model/model.ts:21:15
   name: 'model',
   initialState: [[]] as Model,
   reducers: {
-    setModel: (_state, action: PayloadAction<Model>) => action.payload,
+    setModel: () => undefined,
     resetModel: (_state, action: PayloadAction<BoardSize>) =>
       createZeroMatrix(action.payload),

[Timeout] ArrowFunction
modules/game/model/model.ts:22:17
   initialState: [[]] as Model,
   reducers: {
     setModel: (_state, action: PayloadAction<Model>) => action.payload,
-    resetModel: (_state, action: PayloadAction<BoardSize>) =>
-      createZeroMatrix(action.payload),
+    resetModel: () => undefined,
   },
 });
