[Timeout] ArrowFunction
modules/game/isPlaying/selectors.ts:4:29
 import { NAME_SPACE } from '@/modules/game/nameSpace';
 import { State } from '@/reducer';
 
-export const getIsPlaying = (state: State): boolean =>
-  state[NAME_SPACE].isPlaying;
+export const getIsPlaying = () => undefined;
 
