[Timeout] ArrowFunction
modules/game/model/selectors.ts:8:25
 import { getNextGenMatrix, createZeroMatrix } from '@/modules/game/core';
 import { getSize } from '@/modules/game/size';
 
-export const getModel = (state: State): Model => state[NAME_SPACE].model;
+export const getModel = () => undefined;
 export const getNextGenModel = createSelector(getModel, getNextGenMatrix);
 export const getZeroMatrix = createSelector(getSize, createZeroMatrix);
