[Timeout] BlockStatement
src/modules/game/module.ts:5:65
 import reducer, { NAME_SPACE } from './';
 import { gameStateSaga } from './saga';
 
-export const getGameModule = (): ISagaModule<typeof reducer> => {
-  return {
-    id: 'Game',
-    reducerMap: {
-      [NAME_SPACE]: reducer,
-    },
-    sagas: [gameStateSaga],
-  };
-};
+export const getGameModule = (): ISagaModule<typeof reducer> => {};
 

[Timeout] ObjectLiteral
src/modules/game/module.ts:6:10
 import { gameStateSaga } from './saga';
 
 export const getGameModule = (): ISagaModule<typeof reducer> => {
-  return {
-    id: 'Game',
-    reducerMap: {
-      [NAME_SPACE]: reducer,
-    },
-    sagas: [gameStateSaga],
-  };
+  return {};
 };
 

[Timeout] ObjectLiteral
src/modules/game/module.ts:8:17
 export const getGameModule = (): ISagaModule<typeof reducer> => {
   return {
     id: 'Game',
-    reducerMap: {
-      [NAME_SPACE]: reducer,
-    },
+    reducerMap: {},
     sagas: [gameStateSaga],
   };

[Timeout] ArrayDeclaration
src/modules/game/module.ts:11:12
     reducerMap: {
       [NAME_SPACE]: reducer,
     },
-    sagas: [gameStateSaga],
+    sagas: [],
   };
 };
