[Timeout] BlockStatement
src/modules/game/saga.ts:32:68
 import { State } from '@/reducer';
 import { getGameState } from '@/reducer/selectors';
 
-export const getFromLocalStorage = (key: string): string | null => {
-  return window.localStorage.getItem(key);
-};
+export const getFromLocalStorage = (key: string): string | null => {};
 
 export const saveToLocalStorage = (key: string, state: string): void => {

[Timeout] BlockStatement
src/modules/game/saga.ts:36:73
   return window.localStorage.getItem(key);
 };
 
-export const saveToLocalStorage = (key: string, state: string): void => {
-  window.localStorage.setItem(key, state);
-};
+export const saveToLocalStorage = (key: string, state: string): void => {};
 
 export function* createModel(): Generator<

[Timeout] BlockStatement
src/modules/game/saga.ts:44:3
   StrictEffect,
   void,
   Model | State | BoardSize | FillType
-> {
-  const size = yield select(getSize);
-  const fill = yield select(getFill);
-
-  const model = yield call(
-    createRandomMatrix,
-    size as BoardSize,
-    fill as FillType
-  );
-  yield put(ModelActionCreator.setModel(model as Model));
-}
+> {}
 
 export function* getGameStateFromLocalStorage(): Generator<

[Timeout] BlockStatement
src/modules/game/saga.ts:60:3
   StrictEffect,
   void,
   string | null | GameState
-> {
-  const rawState = yield call(getFromLocalStorage, GAME_KEY);
-  let state: GameState;
-
-  if (rawState) {
-    state = JSON.parse(rawState as string);
-
-    yield put(SizeActionCreator.setSize(state.size));
-    yield put(SpeedActionCreator.setSpeed(state.speed));
-    yield put(FillActionCreator.setFill(state.fill));
-    yield put(IsPlayingActionCreator.setPlaying(state.isPlaying));
-    yield put(ModelActionCreator.setModel(state.model));
-  } else {
-    yield fork(createModel);
-  }
-}
+> {}
 
 export function* saveGameStateToLocalStorage(): Generator<

[Timeout] ConditionalExpression
src/modules/game/saga.ts:64:7
   const rawState = yield call(getFromLocalStorage, GAME_KEY);
   let state: GameState;
 
-  if (rawState) {
+  if (false) {
     state = JSON.parse(rawState as string);
 

[Timeout] BlockStatement
src/modules/game/saga.ts:64:17
   const rawState = yield call(getFromLocalStorage, GAME_KEY);
   let state: GameState;
 
-  if (rawState) {
-    state = JSON.parse(rawState as string);
-
-    yield put(SizeActionCreator.setSize(state.size));
-    yield put(SpeedActionCreator.setSpeed(state.speed));
-    yield put(FillActionCreator.setFill(state.fill));
-    yield put(IsPlayingActionCreator.setPlaying(state.isPlaying));
-    yield put(ModelActionCreator.setModel(state.model));
-  } else {
+  if (rawState) {} else {
     yield fork(createModel);
   }

[Timeout] BlockStatement
src/modules/game/saga.ts:72:10
     yield put(FillActionCreator.setFill(state.fill));
     yield put(IsPlayingActionCreator.setPlaying(state.isPlaying));
     yield put(ModelActionCreator.setModel(state.model));
-  } else {
-    yield fork(createModel);
-  }
+  } else {}
 }
 

[Timeout] BlockStatement
src/modules/game/saga.ts:81:3
   StrictEffect,
   void,
   GameState
-> {
-  const state: GameState = yield select(getGameState);
-  const serializedState = JSON.stringify(state);
-
-  yield call(saveToLocalStorage, GAME_KEY, serializedState);
-}
+> {}
 
 export function* actionsWatcher(): Generator<StrictEffect, void, void> {

[Timeout] BlockStatement
src/modules/game/saga.ts:88:72
   yield call(saveToLocalStorage, GAME_KEY, serializedState);
 }
 
-export function* actionsWatcher(): Generator<StrictEffect, void, void> {
-  const actions = [
-    SizeActionCreator.setSize.type,
-    SpeedActionCreator.setSpeed.type,
-    FillActionCreator.setFill.type,
-    ModelActionCreator.setModel.type,
-    ModelActionCreator.resetModel.type,
-    IsPlayingActionCreator.setPlaying.type,
-    IsPlayingActionCreator.startPlaying.type,
-    IsPlayingActionCreator.stopPlaying.type,
-  ];
-
-  for (const action of actions) {
-    yield takeEvery(action, saveGameStateToLocalStorage);
-  }
-
-  yield takeEvery(SizeActionCreator.setSize.type, createModel);
-  yield takeEvery(FillActionCreator.setFill.type, createModel);
-}
+export function* actionsWatcher(): Generator<StrictEffect, void, void> {}
 
 export function* gameStateSaga(): Generator<StrictEffect, void, void> {

[Timeout] BlockStatement
src/modules/game/saga.ts:100:33
     IsPlayingActionCreator.stopPlaying.type,
   ];
 
-  for (const action of actions) {
-    yield takeEvery(action, saveGameStateToLocalStorage);
-  }
+  for (const action of actions) {}
 
   yield takeEvery(SizeActionCreator.setSize.type, createModel);

[Timeout] BlockStatement
src/modules/game/saga.ts:108:71
   yield takeEvery(FillActionCreator.setFill.type, createModel);
 }
 
-export function* gameStateSaga(): Generator<StrictEffect, void, void> {
-  yield fork(getGameStateFromLocalStorage);
-  yield fork(actionsWatcher);
-}
+export function* gameStateSaga(): Generator<StrictEffect, void, void> {}
 
