[Timeout] ArrowFunction
modules/game/size/selectors.ts:5:24
 import { State } from '@/reducer';
 import { BoardSize } from '.';
 
-export const getSize = (state: State): BoardSize => state[NAME_SPACE].size;
+export const getSize = () => undefined;
 
