[Timeout] ObjectLiteral
modules/game/size/size.ts:20:51
   [BoardSize.SMALL]: SizeProps;
 }
 
-export const BoardSizeValue: BoardSizeValueType = {
-  [BoardSize.LARGE]: { width: 100, height: 80 },
-  [BoardSize.MEDIUM]: { width: 70, height: 50 },
-  [BoardSize.SMALL]: { width: 50, height: 30 },
-};
+export const BoardSizeValue: BoardSizeValueType = {};
 
 const sizeSlice = createSlice({

[Timeout] ObjectLiteral
modules/game/size/size.ts:22:23
 
 export const BoardSizeValue: BoardSizeValueType = {
   [BoardSize.LARGE]: { width: 100, height: 80 },
-  [BoardSize.MEDIUM]: { width: 70, height: 50 },
+  [BoardSize.MEDIUM]: {},
   [BoardSize.SMALL]: { width: 50, height: 30 },
 };

[Timeout] ArrowFunction
modules/game/size/size.ts:30:14
   name: 'size',
   initialState: BoardSize.MEDIUM,
   reducers: {
-    setSize: (_state, action: PayloadAction<BoardSize>) => action.payload,
+    setSize: () => undefined,
   },
 });
