[Timeout] ArrowFunction
modules/game/speed/selectors.ts:5:25
 import { State } from '@/reducer';
 import { SpeedType } from '.';
 
-export const getSpeed = (state: State): SpeedType => state[NAME_SPACE].speed;
+export const getSpeed = () => undefined;
 
