[Timeout] ObjectLiteral
modules/game/speed/speed.ts:16:43
 }
 
 // timeout interval ms
-export const SpeedValue: SpeedValueType = {
-  [SpeedType.FAST]: 30,
-  [SpeedType.MEDIUM]: 150,
-  [SpeedType.SLOW]: 500,
-};
+export const SpeedValue: SpeedValueType = {};
 
 const speedSlice = createSlice({

[Timeout] ArrowFunction
modules/game/speed/speed.ts:26:15
   name: 'speed',
   initialState: SpeedType.MEDIUM,
   reducers: {
-    setSpeed: (_state, action: PayloadAction<SpeedType>) => action.payload,
+    setSpeed: () => undefined,
   },
 });
