[Timeout] BlockStatement
src/modules/game/useGameSettingsRedux.ts:42:55
 
   const dispatch = useDispatch();
 
-  const changeSize = useCallback((size: BoardSize) => {
-    dispatch(SizeActionCreator.setSize(size));
-  }, []);
+  const changeSize = useCallback((size: BoardSize) => {}, []);
 
   const changeSpeed = useCallback((speedType: SpeedType) => {

[Timeout] BlockStatement
src/modules/game/useGameSettingsRedux.ts:46:61
     dispatch(SizeActionCreator.setSize(size));
   }, []);
 
-  const changeSpeed = useCallback((speedType: SpeedType) => {
-    dispatch(SpeedActionCreator.setSpeed(speedType));
-  }, []);
+  const changeSpeed = useCallback((speedType: SpeedType) => {}, []);
 
   const changeFill = useCallback((fill: FillType) => {

[Timeout] BlockStatement
src/modules/game/useGameSettingsRedux.ts:50:54
     dispatch(SpeedActionCreator.setSpeed(speedType));
   }, []);
 
-  const changeFill = useCallback((fill: FillType) => {
-    dispatch(FillActionCreator.setFill(fill));
-  }, []);
+  const changeFill = useCallback((fill: FillType) => {}, []);
 
   return {
