[Timeout] BlockStatement
modules/game/utils/utils.ts:6:16
 export const getRandomValuesArr = (
   maxValue: number,
   amount: number
-): number[] => {
-  if (maxValue < amount) {
-    throw new Error('items amount cannot be more then max value');
-  }
-
-  const cache: number[] = [];
-
-  const result = Array.from({ length: amount }, () => {
-    let random;
-
-    do {
-      random = getRandomValue(maxValue);
-    } while (cache[random]);
-
-    cache[random] = 1;
-
-    return random;
-  });
-
-  return result;
-};
+): number[] => {};
 
 export const getRandomValue = (maxValue: number): number => {

[Timeout] EqualityOperator
modules/game/utils/utils.ts:7:7
   maxValue: number,
   amount: number
 ): number[] => {
-  if (maxValue < amount) {
+  if (maxValue <= amount) {
     throw new Error('items amount cannot be more then max value');
   }

[Timeout] BlockStatement
modules/game/utils/utils.ts:7:26
   maxValue: number,
   amount: number
 ): number[] => {
-  if (maxValue < amount) {
-    throw new Error('items amount cannot be more then max value');
-  }
+  if (maxValue < amount) {}
 
   const cache: number[] = [];

[Timeout] StringLiteral
modules/game/utils/utils.ts:8:21
   amount: number
 ): number[] => {
   if (maxValue < amount) {
-    throw new Error('items amount cannot be more then max value');
+    throw new Error("");
   }
 

[Timeout] BlockStatement
modules/game/utils/utils.ts:13:55
 
   const cache: number[] = [];
 
-  const result = Array.from({ length: amount }, () => {
-    let random;
-
-    do {
-      random = getRandomValue(maxValue);
-    } while (cache[random]);
-
-    cache[random] = 1;
-
-    return random;
-  });
+  const result = Array.from({ length: amount }, () => {});
 
   return result;

[Timeout] BlockStatement
modules/game/utils/utils.ts:16:8
   const result = Array.from({ length: amount }, () => {
     let random;
 
-    do {
-      random = getRandomValue(maxValue);
-    } while (cache[random]);
+    do {} while (cache[random]);
 
     cache[random] = 1;

[Timeout] ConditionalExpression
modules/game/utils/utils.ts:18:14
 
     do {
       random = getRandomValue(maxValue);
-    } while (cache[random]);
+    } while (false);
 
     cache[random] = 1;

[Timeout] BlockStatement
modules/game/utils/utils.ts:28:61
   return result;
 };
 
-export const getRandomValue = (maxValue: number): number => {
-  return Math.floor(Math.random() * maxValue);
-};
+export const getRandomValue = (maxValue: number): number => {};
 
 export const getMatrixItemNeighbours = (

[Timeout] ArithmeticOperator
modules/game/utils/utils.ts:29:21
 };
 
 export const getRandomValue = (maxValue: number): number => {
-  return Math.floor(Math.random() * maxValue);
+  return Math.floor(Math.random() / maxValue);
 };
 

[Timeout] EqualityOperator
modules/game/utils/utils.ts:39:7
 ): number[] => {
   const neighBours = [];
 
-  if (columnIndex > 0) {
+  if (columnIndex <= 0) {
     neighBours.push(matrix[rowIndex][columnIndex - 1]);
 

[Timeout] ConditionalExpression
modules/game/utils/utils.ts:39:7
 ): number[] => {
   const neighBours = [];
 
-  if (columnIndex > 0) {
+  if (true) {
     neighBours.push(matrix[rowIndex][columnIndex - 1]);
 

[Timeout] ArithmeticOperator
modules/game/utils/utils.ts:40:38
   const neighBours = [];
 
   if (columnIndex > 0) {
-    neighBours.push(matrix[rowIndex][columnIndex - 1]);
+    neighBours.push(matrix[rowIndex][columnIndex + 1]);
 
     if (rowIndex > 0) {

[Timeout] ConditionalExpression
modules/game/utils/utils.ts:42:9
   if (columnIndex > 0) {
     neighBours.push(matrix[rowIndex][columnIndex - 1]);
 
-    if (rowIndex > 0) {
+    if (true) {
       neighBours.push(matrix[rowIndex - 1][columnIndex - 1]);
     }

[Timeout] EqualityOperator
modules/game/utils/utils.ts:42:9
   if (columnIndex > 0) {
     neighBours.push(matrix[rowIndex][columnIndex - 1]);
 
-    if (rowIndex > 0) {
+    if (rowIndex >= 0) {
       neighBours.push(matrix[rowIndex - 1][columnIndex - 1]);
     }

[Timeout] ArithmeticOperator
modules/game/utils/utils.ts:43:30
     neighBours.push(matrix[rowIndex][columnIndex - 1]);
 
     if (rowIndex > 0) {
-      neighBours.push(matrix[rowIndex - 1][columnIndex - 1]);
+      neighBours.push(matrix[rowIndex + 1][columnIndex - 1]);
     }
 

[Timeout] ArithmeticOperator
modules/game/utils/utils.ts:43:44
     neighBours.push(matrix[rowIndex][columnIndex - 1]);
 
     if (rowIndex > 0) {
-      neighBours.push(matrix[rowIndex - 1][columnIndex - 1]);
+      neighBours.push(matrix[rowIndex - 1][columnIndex + 1]);
     }
 

[Timeout] ArithmeticOperator
modules/game/utils/utils.ts:46:20
       neighBours.push(matrix[rowIndex - 1][columnIndex - 1]);
     }
 
-    if (rowIndex < matrix.length - 1) {
+    if (rowIndex < matrix.length + 1) {
       neighBours.push(matrix[rowIndex + 1][columnIndex - 1]);
     }

[Timeout] BlockStatement
modules/game/utils/utils.ts:46:39
       neighBours.push(matrix[rowIndex - 1][columnIndex - 1]);
     }
 
-    if (rowIndex < matrix.length - 1) {
-      neighBours.push(matrix[rowIndex + 1][columnIndex - 1]);
-    }
+    if (rowIndex < matrix.length - 1) {}
   }
 

[Timeout] ArithmeticOperator
modules/game/utils/utils.ts:47:30
     }
 
     if (rowIndex < matrix.length - 1) {
-      neighBours.push(matrix[rowIndex + 1][columnIndex - 1]);
+      neighBours.push(matrix[rowIndex - 1][columnIndex - 1]);
     }
   }

[Timeout] ArithmeticOperator
modules/game/utils/utils.ts:47:44
     }
 
     if (rowIndex < matrix.length - 1) {
-      neighBours.push(matrix[rowIndex + 1][columnIndex - 1]);
+      neighBours.push(matrix[rowIndex + 1][columnIndex + 1]);
     }
   }

[Timeout] ConditionalExpression
modules/game/utils/utils.ts:51:7
     }
   }
 
-  if (columnIndex < matrix[rowIndex].length - 1) {
+  if (true) {
     neighBours.push(matrix[rowIndex][columnIndex + 1]);
 

[Timeout] ArithmeticOperator
modules/game/utils/utils.ts:51:21
     }
   }
 
-  if (columnIndex < matrix[rowIndex].length - 1) {
+  if (columnIndex < matrix[rowIndex].length + 1) {
     neighBours.push(matrix[rowIndex][columnIndex + 1]);
 

[Timeout] ArithmeticOperator
modules/game/utils/utils.ts:52:38
   }
 
   if (columnIndex < matrix[rowIndex].length - 1) {
-    neighBours.push(matrix[rowIndex][columnIndex + 1]);
+    neighBours.push(matrix[rowIndex][columnIndex - 1]);
 
     if (rowIndex > 0) {

[Timeout] ArithmeticOperator
modules/game/utils/utils.ts:55:44
     neighBours.push(matrix[rowIndex][columnIndex + 1]);
 
     if (rowIndex > 0) {
-      neighBours.push(matrix[rowIndex - 1][columnIndex + 1]);
+      neighBours.push(matrix[rowIndex - 1][columnIndex - 1]);
     }
 

[Timeout] ArithmeticOperator
modules/game/utils/utils.ts:55:30
     neighBours.push(matrix[rowIndex][columnIndex + 1]);
 
     if (rowIndex > 0) {
-      neighBours.push(matrix[rowIndex - 1][columnIndex + 1]);
+      neighBours.push(matrix[rowIndex + 1][columnIndex + 1]);
     }
 

[Timeout] ConditionalExpression
modules/game/utils/utils.ts:58:9
       neighBours.push(matrix[rowIndex - 1][columnIndex + 1]);
     }
 
-    if (rowIndex < matrix.length - 1) {
+    if (true) {
       neighBours.push(matrix[rowIndex + 1][columnIndex + 1]);
     }

[Timeout] EqualityOperator
modules/game/utils/utils.ts:58:9
       neighBours.push(matrix[rowIndex - 1][columnIndex + 1]);
     }
 
-    if (rowIndex < matrix.length - 1) {
+    if (rowIndex >= matrix.length - 1) {
       neighBours.push(matrix[rowIndex + 1][columnIndex + 1]);
     }

[Timeout] ArithmeticOperator
modules/game/utils/utils.ts:59:30
     }
 
     if (rowIndex < matrix.length - 1) {
-      neighBours.push(matrix[rowIndex + 1][columnIndex + 1]);
+      neighBours.push(matrix[rowIndex - 1][columnIndex + 1]);
     }
   }

[Timeout] ArithmeticOperator
modules/game/utils/utils.ts:59:44
     }
 
     if (rowIndex < matrix.length - 1) {
-      neighBours.push(matrix[rowIndex + 1][columnIndex + 1]);
+      neighBours.push(matrix[rowIndex + 1][columnIndex - 1]);
     }
   }

[Timeout] BlockStatement
modules/game/utils/utils.ts:63:21
     }
   }
 
-  if (rowIndex > 0) {
-    neighBours.push(matrix[rowIndex - 1][columnIndex]);
-  }
+  if (rowIndex > 0) {}
 
   if (rowIndex < matrix.length - 1) {

[Timeout] ConditionalExpression
modules/game/utils/utils.ts:63:7
     }
   }
 
-  if (rowIndex > 0) {
+  if (false) {
     neighBours.push(matrix[rowIndex - 1][columnIndex]);
   }

[Timeout] ArithmeticOperator
modules/game/utils/utils.ts:64:28
   }
 
   if (rowIndex > 0) {
-    neighBours.push(matrix[rowIndex - 1][columnIndex]);
+    neighBours.push(matrix[rowIndex + 1][columnIndex]);
   }
 

[Timeout] BlockStatement
modules/game/utils/utils.ts:67:37
     neighBours.push(matrix[rowIndex - 1][columnIndex]);
   }
 
-  if (rowIndex < matrix.length - 1) {
-    neighBours.push(matrix[rowIndex + 1][columnIndex]);
-  }
+  if (rowIndex < matrix.length - 1) {}
 
   return neighBours;

[Timeout] ArithmeticOperator
modules/game/utils/utils.ts:68:28
   }
 
   if (rowIndex < matrix.length - 1) {
-    neighBours.push(matrix[rowIndex + 1][columnIndex]);
+    neighBours.push(matrix[rowIndex - 1][columnIndex]);
   }
 

[Timeout] BlockStatement
modules/game/utils/utils.ts:74:63
   return neighBours;
 };
 
-export const getZeroMatrix = (size: SizeProps): number[][] => {
-  const { width, height } = size;
-
-  return Array.from({ length: height }, () => {
-    return Array.from({ length: width }, () => 0);
-  });
-};
+export const getZeroMatrix = (size: SizeProps): number[][] => {};
 

[Timeout] BlockStatement
modules/game/utils/utils.ts:77:47
 export const getZeroMatrix = (size: SizeProps): number[][] => {
   const { width, height } = size;
 
-  return Array.from({ length: height }, () => {
-    return Array.from({ length: width }, () => 0);
-  });
+  return Array.from({ length: height }, () => {});
 };
 

[Timeout] ArrowFunction
modules/game/utils/utils.ts:78:42
   const { width, height } = size;
 
   return Array.from({ length: height }, () => {
-    return Array.from({ length: width }, () => 0);
+    return Array.from({ length: width }, () => undefined);
   });
 };
