[Timeout] BlockStatement
src/modules/user/StartPopup.tsx:34:24
   box-shadow: inset 1px 1px 3px rgb(0 0 0 / 30%), 1px 1px 0 rgb(0 0 0 / 10%);
 `;
 
-const Form: FC = () => {
-  const { currentName, setName, signin, resetName } = useAuth();
-
-  const onSubmit = (evt: React.FormEvent): void => {
-    evt.preventDefault();
-
-    signin();
-    resetName();
-  };
-
-  return (
-    <FormItem data-testid='start-form' onSubmit={onSubmit}>
-      <InputItem
-        data-testid='name-input'
-        value={currentName}
-        placeholder={'Enter Your Name:'}
-        onChange={(evt) => setName(evt.target.value)}
-        required
-      />
-      <Button>Start</Button>
-    </FormItem>
-  );
-};
+const Form: FC = () => {};
 
 export const StartPopup: FC = () => {

[Timeout] BlockStatement
src/modules/user/StartPopup.tsx:37:52
 const Form: FC = () => {
   const { currentName, setName, signin, resetName } = useAuth();
 
-  const onSubmit = (evt: React.FormEvent): void => {
-    evt.preventDefault();
-
-    signin();
-    resetName();
-  };
+  const onSubmit = (evt: React.FormEvent): void => {};
 
   return (

[Timeout] StringLiteral
src/modules/user/StartPopup.tsx:49:22
       <InputItem
         data-testid='name-input'
         value={currentName}
-        placeholder={'Enter Your Name:'}
+        placeholder={""}
         onChange={(evt) => setName(evt.target.value)}
         required

[Timeout] ArrowFunction
src/modules/user/StartPopup.tsx:50:19
         data-testid='name-input'
         value={currentName}
         placeholder={'Enter Your Name:'}
-        onChange={(evt) => setName(evt.target.value)}
+        onChange={() => undefined}
         required
       />

[Timeout] BlockStatement
src/modules/user/StartPopup.tsx:58:37
   );
 };
 
-export const StartPopup: FC = () => {
-  return (
-    <PopupItem data-testid='start-popup'>
-      <Form />
-    </PopupItem>
-  );
-};
+export const StartPopup: FC = () => {};
 
