[Timeout] BlockStatement
src/modules/user/module.ts:5:67
 import reducer, { NAME_SPACE } from './';
 import { userStateSaga } from './saga';
 
-export const getSigninModule = (): ISagaModule<typeof reducer> => {
-  return {
-    id: 'Signin',
-    reducerMap: {
-      [NAME_SPACE]: reducer,
-    },
-    sagas: [userStateSaga],
-  };
-};
+export const getSigninModule = (): ISagaModule<typeof reducer> => {};
 

[Timeout] StringLiteral
src/modules/user/module.ts:7:9
 
 export const getSigninModule = (): ISagaModule<typeof reducer> => {
   return {
-    id: 'Signin',
+    id: "",
     reducerMap: {
       [NAME_SPACE]: reducer,
