[Timeout] BlockStatement
src/modules/user/saga.ts:26:3
   StrictEffect,
   void,
   string | null | UserState
-> {
-  const rawUserState = yield call(getFromLocalStorage, USER_KEY);
-  let userState: UserState;
-
-  if (rawUserState) {
-    userState = JSON.parse(rawUserState as string);
-
-    yield put(UserActionCreator.signin(userState.userData));
-  }
-}
+> {}
 
 export function* saveUserStateToLocalStorage(): Generator<

[Timeout] BlockStatement
src/modules/user/saga.ts:30:21
   const rawUserState = yield call(getFromLocalStorage, USER_KEY);
   let userState: UserState;
 
-  if (rawUserState) {
-    userState = JSON.parse(rawUserState as string);
-
-    yield put(UserActionCreator.signin(userState.userData));
-  }
+  if (rawUserState) {}
 }
 

[Timeout] ConditionalExpression
src/modules/user/saga.ts:30:7
   const rawUserState = yield call(getFromLocalStorage, USER_KEY);
   let userState: UserState;
 
-  if (rawUserState) {
+  if (false) {
     userState = JSON.parse(rawUserState as string);
 

[Timeout] BlockStatement
src/modules/user/saga.ts:41:3
   StrictEffect,
   void,
   UserState
-> {
-  const userState: UserState = yield select(getUserState);
-  const serializedState = JSON.stringify(userState);
-
-  yield call(saveToLocalStorage, USER_KEY, serializedState);
-}
+> {}
 
 export function* actionsWatcher(): Generator<StrictEffect, void, void> {

[Timeout] BlockStatement
src/modules/user/saga.ts:48:72
   yield call(saveToLocalStorage, USER_KEY, serializedState);
 }
 
-export function* actionsWatcher(): Generator<StrictEffect, void, void> {
-  const actions = [
-    UserActionCreator.signin.type,
-    UserActionCreator.signout.type,
-  ];
-
-  for (const action of actions) {
-    yield takeEvery(action, saveUserStateToLocalStorage);
-  }
-}
+export function* actionsWatcher(): Generator<StrictEffect, void, void> {}
 
 export function* userStateSaga(): Generator<StrictEffect, void, void> {

[Timeout] BlockStatement
src/modules/user/saga.ts:54:33
     UserActionCreator.signout.type,
   ];
 
-  for (const action of actions) {
-    yield takeEvery(action, saveUserStateToLocalStorage);
-  }
+  for (const action of actions) {}
 }
 

[Timeout] BlockStatement
src/modules/user/saga.ts:59:71
   }
 }
 
-export function* userStateSaga(): Generator<StrictEffect, void, void> {
-  yield fork(getUserStateFromLocalStorage);
-  yield fork(actionsWatcher);
-}
+export function* userStateSaga(): Generator<StrictEffect, void, void> {}
 
