[Timeout] ArrowFunction
src/modules/user/selectors.ts:5:24
 import { State } from '@/reducer';
 import { UserType } from '.';
 
-export const getUser = (state: State): UserType => state[NAME_SPACE].userData;
+export const getUser = () => undefined;
 
