[Timeout] BlockStatement
src/modules/user/user.ts:18:57
   name: 'user',
   initialState,
   reducers: {
-    signin: (state, action: PayloadAction<UserType>) => {
-      state.userData = action.payload;
-    },
+    signin: (state, action: PayloadAction<UserType>) => {},
     signout: () => initialState,
   },

[Timeout] ArrowFunction
src/modules/user/user.ts:21:14
     signin: (state, action: PayloadAction<UserType>) => {
       state.userData = action.payload;
     },
-    signout: () => initialState,
+    signout: () => undefined,
   },
 });
