[Survived] StringLiteral
otus-reactjs/src/screens/GameScreen.tsx:11:27
 
 import { getGameModule } from '@/modules/game';
 
-const Wrapper = styled.div`
-  display: flex;
-  flex-direction: column;
-  align-items: center;
-`;
+const Wrapper = styled.div``;
 
 const dynamicReduxModules = [getGameModule()];

[Killed] ArrayDeclaration
otus-reactjs/src/screens/GameScreen.tsx:17:29
   align-items: center;
 `;
 
-const dynamicReduxModules = [getGameModule()];
+const dynamicReduxModules = [];
 
 export const GameScreen: FC<HeaderPropsType> = ({ user, signout }) => {
killedBy: App signs in and signs out correctly
statusReason: TestingLibraryElementError: Unable to find an element with the text: Hello, Andrey!. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, <script />, <style />
<body>
  <div>
    <h1>
      Something went wrong.
    </h1>

[Killed] BlockStatement
otus-reactjs/src/screens/GameScreen.tsx:19:71
 
 const dynamicReduxModules = [getGameModule()];
 
-export const GameScreen: FC<HeaderPropsType> = ({ user, signout }) => {
-  return (
-    <ErrorBoundary>
-      <Wrapper>
-        <Header user={user} signout={signout} />
-        <DynamicModuleLoader modules={dynamicReduxModules}>
-          <InteractiveGame />
-        </DynamicModuleLoader>
-      </Wrapper>
-    </ErrorBoundary>
-  );
-};
+export const GameScreen: FC<HeaderPropsType> = ({ user, signout }) => {};
 
killedBy: App renders correctly
statusReason: TestingLibraryElementError: Unable to find an element by: [data-testid="start-form"]

Ignored nodes: comments, <script />, <style />
<body>
  <div>
    <h1>
      Something went wrong.
    </h1>
