[Survived] StringLiteral
otus-reactjs/src/screens/SigninScreen.tsx:6:32
 import { ErrorBoundary } from '@/components/ErrorBoundary';
 import { StartPopup } from '@/modules/user/StartPopup';
 
-const PopupWrapper = styled.div`
-  position: fixed;
-  top: 0;
-  bottom: 0;
-  left: 0;
-  right: 0;
-  background-color: rgba(8, 0, 18, 0.85);
-`;
+const PopupWrapper = styled.div``;
 
 export const SigninScreen: FC = () => {

[Killed] BlockStatement
otus-reactjs/src/screens/SigninScreen.tsx:15:39
   background-color: rgba(8, 0, 18, 0.85);
 `;
 
-export const SigninScreen: FC = () => {
-  return (
-    <ErrorBoundary>
-      <PopupWrapper>
-        <StartPopup />
-      </PopupWrapper>
-    </ErrorBoundary>
-  );
-};
+export const SigninScreen: FC = () => {};
 
killedBy: App renders correctly
statusReason: TestingLibraryElementError: Unable to find an element by: [data-testid="start-form"]

Ignored nodes: comments, <script />, <style />
<body>
  <div>
    <h1>
      Something went wrong.
    </h1>
