[Timeout] ArrowFunction
otus-reactjs/src/reducer/selectors.ts:5:29
 import { GameState, NAME_SPACE as GAME_NAME_SPACE } from '@/modules/game';
 import { State } from '@/reducer';
 
-export const getUserState = (state: State): UserState => state[USER_NAME_SPACE];
+export const getUserState = () => undefined;
 export const getGameState = (state: State): GameState => state[GAME_NAME_SPACE];
 

[Timeout] ArrowFunction
otus-reactjs/src/reducer/selectors.ts:6:29
 import { State } from '@/reducer';
 
 export const getUserState = (state: State): UserState => state[USER_NAME_SPACE];
-export const getGameState = (state: State): GameState => state[GAME_NAME_SPACE];
+export const getGameState = () => undefined;
 
